
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>图解HTTP · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="高性能JavaScript.html" />
    
    
    <link rel="prev" href="javaScript高级程序设计.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="javaScript高级程序设计.html">
            
                <a href="javaScript高级程序设计.html">
            
                    
                    JavaScript 高级程序设计
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="图解HTTP.html">
            
                <a href="图解HTTP.html">
            
                    
                    图解HTTP
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="高性能JavaScript.html">
            
                <a href="高性能JavaScript.html">
            
                    
                    高性能JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="响应式web设计html5和css3实战.html">
            
                <a href="响应式web设计html5和css3实战.html">
            
                    
                    响应式web设计html5和css3实战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../note/React.html">
            
                <a href="../note/React.html">
            
                    
                    React笔记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >图解HTTP</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x56FE;&#x89E3;-http">&#x56FE;&#x89E3; http</h1>
<h2 id="&#x7B2C;&#x4E00;&#x7AE0;">&#x7B2C;&#x4E00;&#x7AE0;</h2>
<ol>
<li>&#x8BA1;&#x7B97;&#x673A;&#x4E0E;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x8981;&#x76F8;&#x4E92;&#x901A;&#x4FE1;&#xFF0C;&#x53CC;&#x65B9;&#x5C31;&#x5FC5;&#x987B;&#x57FA;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x4EF6;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x89C4;&#x5219;&#x3002;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x8FD9;&#x79CD;&#x89C4;&#x5219;&#x79F0;&#x4E3A;&#x534F;&#x8BAE;<code>protocol</code></li>
<li>&#x50CF;&#x8FD9;&#x6837;&#x628A;&#x4E0E;&#x4E92;&#x8054;&#x7F51;&#x5173;&#x8054;&#x7684;&#x534F;&#x8BAE;&#x96C6;&#x5408;&#x8D77;&#x6765;&#x603B;&#x79F0;&#x4E3A;<code>TCP/IP</code>&#x3002;&#x4E5F;&#x6709;&#x8BF4;&#x6CD5;&#x8BA4;&#x4E3A;&#xFF0C;<code>TCP/IP</code>&#x662F;&#x6307;<code>TCP</code>&#x548C;<code>IP</code>&#x8FD9;&#x4E24;&#x79CD;&#x534F;&#x8BAE;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#x8BA4;&#x4E3A;&#xFF0C;<code>TCP/IP</code>&#x662F;&#x5728;<code>IP</code>&#x534F;&#x8BAE;&#x7684;&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x534F;&#x8BAE;&#x65CF;&#x7684;&#x7EDF;&#x79F0;&#x3002;</li>
<li><code>TCP/IP</code>&#x534F;&#x8BAE;&#x65CF;&#x91CC;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x5206;&#x5C42;&#x3002;<code>TCP/IP</code>&#x534F;&#x8BAE;&#x65CF;&#x6309;&#x5C42;&#x6B21;&#x5206;&#x522B;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B; 4 &#x5C42;&#xFF1A;&#x5E94;&#x7528;&#x5C42;&#x3001;&#x4F20;&#x8F93;&#x5C42;&#x3001;&#x7F51;&#x7EDC;&#x5C42;&#x548C;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x3002;</li>
<li>&#x628A;<code>TCP/IP</code>&#x5C42;&#x6B21;&#x5316;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF0C;<strong>&#x5982;&#x679C;&#x4E92;&#x8054;&#x7F51;&#x53EA;&#x7531;&#x4E00;&#x4E2A;&#x534F;&#x8BAE;&#x7EDF;&#x7B79;&#xFF0C;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x9700;&#x8981;&#x6539;&#x53D8;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x628A;&#x6240;&#x6709;&#x90E8;&#x5206;&#x6574;&#x4F53;&#x66FF;&#x6362;&#x6389;&#x3002;&#x800C;&#x5206;&#x5C42;&#x4E4B;&#x540E;&#x53EA;&#x9700;&#x628A;&#x53D8;&#x52A8;&#x7684;&#x5C42;&#x66FF;&#x6362;&#x6389;&#x5373;&#x53EF;</strong>&#x3002;&#x628A;&#x5404;&#x5C42;&#x4E4B;&#x95F4;&#x7684;&#x63A5;&#x53E3;&#x90E8;&#x5206;&#x89C4;&#x5212;&#x597D;&#x4E4B;&#x540E;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C42;&#x6B21;&#x5185;&#x90E8;&#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x80FD;&#x591F;&#x81EA;&#x7531;&#x6539;&#x52A8;&#x4E86;&#x3002;&#xFF08;<strong>&#x8FD9;&#x6BB5;&#x540C;&#x5199;&#x4EE3;&#x7801;&#x4E00;&#x6837;</strong>&#xFF09;</li>
<li><strong>&#x5C42;&#x6B21;&#x5316;&#x4E4B;&#x540E;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E5F;&#x53D8;&#x5F97;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x4E86;&#x3002;&#x5904;&#x4E8E;&#x5E94;&#x7528;&#x5C42;&#x4E0A;&#x7684;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x53EA;&#x8003;&#x8651;&#x5206;&#x6D3E;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5F04;&#x6E05;&#x5BF9;&#x65B9;&#x5728;&#x5730;&#x7403;&#x4E0A;&#x54EA;&#x4E2A;&#x5730;&#x65B9;&#x3001;&#x5BF9;&#x65B9;&#x7684;&#x4F20;&#x8F93;&#x8DEF;&#x7EBF;&#x662F;&#x600E;&#x6837;&#x7684;&#x3001;&#x662F;&#x5426;&#x80FD;&#x591F;&#x786E;&#x4FDD;&#x4F20;&#x8F93;&#x9001;&#x8FBE;&#x7B49;&#x95EE;&#x9898;&#x3002;</strong>&#xFF08;<strong>&#x8FD9;&#x6BB5;&#x540C; MV*&#x6A21;&#x5F0F;</strong>&#xFF09;</li>
<li><p>TCP/IP &#x534F;&#x8BAE;&#x65CF;&#x5404;&#x5C42;&#x7684;&#x4F5C;&#x7528;&#xFF1A;</p>
<ul>
<li>&#x5E94;&#x7528;&#x5C42;</li>
<li>&#x5E94;&#x7528;&#x5C42;&#x51B3;&#x5B9A;&#x4E86;&#x5411;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x65F6;&#x901A;&#x4FE1;&#x7684;&#x6D3B;&#x52A8;&#x3002;&#x5982; FTP&#x3001;DNS &#x7B49;&#x3002;<strong>HTTP &#x534F;&#x8BAE;&#x4E5F;&#x5904;&#x4E8E;&#x8BE5;&#x5C42;&#x3002;</strong></li>
<li>&#x4F20;&#x8F93;&#x5C42;</li>
<li>&#x4F20;&#x8F93;&#x5C42;&#x5BF9;&#x4E0A;&#x5C42;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x63D0;&#x4F9B;&#x5904;&#x4E8E;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x4E2D;&#x7684;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002;<em>TCP</em></li>
<li>&#x7F51;&#x7EDC;&#x5C42;</li>
<li>&#x7F51;&#x7EDC;&#x5C42;&#x7528;&#x6765;&#x5904;&#x7406;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x6D41;&#x52A8;&#x7684;&#x6570;&#x636E;&#x5305;&#x3002;&#x8BE5;&#x5C42;&#x89C4;&#x5B9A;&#x4E86;&#x901A;&#x8FC7;&#x600E;&#x6837;&#x7684;&#x8DEF;&#x5F84;&#x5230;&#x8FBE;&#x5BF9;&#x65B9;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5E76;&#x628A;&#x6570;&#x636E;&#x5305;&#x4F20;&#x9001;&#x7ED9;&#x5BF9;&#x65B9;&#x3002; &#x4E0E;&#x5BF9;&#x65B9;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x591A;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x6216;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x4F20;&#x8F93;&#x65F6;&#xFF0C;&#x7F51;&#x7EDC;&#x5C42;&#x63D0;&#x4F9B;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x5728;&#x4F17;&#x591A;&#x7684;&#x9009;&#x9879;&#x5185;&#x63D0;&#x4F9B;&#x4E00;&#x6761;&#x4F20;&#x8F93;&#x8DEF;&#x7EBF;&#x3002;<strong>IP</strong></li>
<li>&#x94FE;&#x8DEF;&#x5C42;</li>
<li>&#x7528;&#x6765;&#x5904;&#x7406;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#x7684;&#x786C;&#x4EF6;&#x90E8;&#x5206;&#x3002;<strong>&#x7F51;&#x7EDC;</strong></li>
</ul>
</li>
<li><p>&#x53D1;&#x9001;&#x7AEF;&#x5728;&#x5C42;&#x4E0E;&#x5C42;&#x4F20;&#x9001;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4F1A;&#x88AB;&#x6253;&#x4E0A;&#x8BE5;&#x5C42;&#x6240;&#x5C5E;&#x7684;&#x9996;&#x90E8;&#x4FE1;&#x606F;&#x3002;&#x63A5;&#x6536;&#x7AEF;&#x5728;&#x5C42;&#x4E0E;&#x5C42;&#x4E4B;&#x95F4;&#x4F1A;&#x628A;&#x5BF9;&#x5E94;&#x7684;&#x9996;&#x90E8;&#x6D88;&#x53BB;&#x3002;&#x8FD9;&#x79CD;&#x628A;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x5305;&#x88C5;&#x8D77;&#x6765;&#x7684;&#x505A;&#x6CD5;&#x79F0;&#x4E3A;&#x5C01;&#x88C5;&#x3002;</p>
</li>
<li>TCP &#x534F;&#x8BAE;&#x91C7;&#x7528;&#x4E86;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x7B56;&#x7565;&#x3002;&#x53D1;&#x9001;&#x7AEF;&#x9996;&#x5148;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x5E26;&#x6709; SYN &#x6807;&#x5FD7;&#x7684;&#x6570;&#x636E;&#x5305;&#x7ED9;&#x5BF9;&#x65B9;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x6536;&#x5230;&#x540E;&#xFF0C;&#x56DE;&#x4F20;&#x4E00;&#x4E2A; SYN/ACK &#x6807;&#x5FD7;&#x7684;&#x6570;&#x636E;&#x5305;&#x4EE5;&#x793A;&#x4F20;&#x8FBE;&#x786E;&#x8BA4;&#x4FE1;&#x606F;&#x3002;&#x6700;&#x540E;&#x53D1;&#x9001;&#x7AEF;&#x518D;&#x56DE;&#x4F20;&#x4E00;&#x4E2A;&#x5E26; ACK &#x6807;&#x5FD7;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x4EE3;&#x8868;&#x63E1;&#x624B;&#x7ED3;&#x675F;&#x3002;</li>
<li><strong>DNS&#xFF08;Domain Name System&#xFF09;&#x63D0;&#x4F9B;&#x57DF;&#x540D;&#x5230; IP &#x5730;&#x5740;&#x4E4B;&#x95F4;&#x7684;&#x89E3;&#x6790;&#x670D;&#x52A1;&#x3002;</strong>
&#x4E00;&#x822C;&#x7528;&#x6237;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x57DF;&#x540D;&#x6765;&#x8BBF;&#x95EE;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7; IP &#x5730;&#x5740;&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x56E0;&#x4E3A;&#x8BB0;&#x4F4F;&#x4E00;&#x4E32;&#x6570;&#x5B57;&#x6BD4;&#x8F83;&#x96BE;&#x3002;&#x4F46;&#x662F;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x53BB;&#x7406;&#x89E3;&#x540D;&#x79F0;&#x5C31;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#x4E86;&#xFF0C;&#x6240;&#x4EE5; DNS &#x670D;&#x52A1;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#x3002;&#x901A;&#x8FC7;&#x57DF;&#x540D;&#x6765;&#x67E5;&#x627E;&#x5730;&#x5740;&#xFF0C;&#x7136;&#x540E;&#x53CD;&#x9988;&#x4E00;&#x4E2A; IP &#x5730;&#x5740;&#x3002; - &#x53D1;&#x9001;&#x7AEF;&#x8F93;&#x5165;&#x7F51;&#x5740; - DNS &#x8FD4;&#x56DE;&#x4E00;&#x4E2A; IP &#x5730;&#x5740; - &#x53D1;&#x9001;&#x7AEF;&#x7528; IP &#x5730;&#x5740;&#x6765;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x3002;</li>
<li>URI&#xFF08;&#x7EDF;&#x4E00;&#x8D44;&#x6E90;&#x6807;&#x8BC6;&#x7B26;&#xFF09;&#xFF1B;URL&#xFF08;&#x7EDF;&#x4E00;&#x8D44;&#x6E90;&#x5B9A;&#x4F4D;&#x7B26;&#xFF09;&#xFF1B;URI &#x7528;&#x5B57;&#x7B26;&#x4E32;&#x6807;&#x8BC6;&#x67D0;&#x4E00;&#x4E92;&#x8054;&#x7F51;&#x8D44;&#x6E90;&#xFF1B;URL &#x8868;&#x793A;&#x8D44;&#x6E90;&#x7684;&#x5730;&#x70B9;&#xFF1B;URL &#x662F; URI &#x7684;&#x5B50;&#x96C6;&#xFF1B;</li>
</ol>
<h2 id="&#x7B2C;&#x4E8C;&#x7AE0;">&#x7B2C;&#x4E8C;&#x7AE0;</h2>
<ol>
<li>HTTP &#x534F;&#x8BAE;&#x7528;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;</li>
<li><p>&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li>GET&#xFF0C;&#x83B7;&#x53D6;&#x8D44;&#x6E90;&#xFF0C;get &#x65B9;&#x6CD5;&#x7528;&#x6765;&#x8BF7;&#x6C42;&#x8BBF;&#x95EE;&#x5DF2;&#x88AB; uri &#x8BC6;&#x522B;&#x7684;&#x8D44;&#x6E90;&#x3002;</li>
<li>POST&#xFF0C;&#x4F20;&#x8F93;&#x5B9E;&#x4F53;&#x4E3B;&#x9898;&#x3002;</li>
<li>PUT&#xFF0C;&#x7528;&#x6765;&#x4F20;&#x8F93;&#x6587;&#x4EF6;&#xFF0C;&#x8981;&#x6C42;&#x5728;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x7684;&#x4E3B;&#x4F53;&#x4E2D;&#x5305;&#x542B;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#xFF0C;&#x7136;&#x540E;&#x4FDD;&#x5B58;&#x5230;&#x8BF7;&#x6C42; URI &#x6307;&#x5B9A;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x7531;&#x4E8E; put &#x65B9;&#x6CD5;&#x672C;&#x8EAB;&#x4E0D;&#x5E26;&#x9A8C;&#x8BC1;&#x673A;&#x5236;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x80FD;&#x591F;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#xFF0C;&#x5B58;&#x5728;&#x5B89;&#x5168;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x822C;&#x7684; web &#x7F51;&#x7AD9;&#x4E0D;&#x9002;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x3002;</li>
<li>HEAD&#xFF1A;&#x83B7;&#x5F97;&#x62A5;&#x6587;&#x9996;&#x90E8;&#xFF08;&#x8DDF; GET &#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x662F;&#x4E0D;&#x8FD4;&#x56DE;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x90E8;&#x5206;&#xFF09;</li>
<li>DELETE&#xFF1A;&#x5220;&#x9664;&#x6587;&#x4EF6;&#xFF08;&#x662F;&#x4E0E; PUT &#x76F8;&#x53CD;&#x7684;&#x65B9;&#x6CD5;&#xFF09;</li>
<li>OPTIONS&#xFF1A;options &#x65B9;&#x6CD5;&#x7528;&#x6765;&#x67E5;&#x8BE2;&#x9488;&#x5BF9;&#x8BF7;&#x6C42; uri &#x6307;&#x5B9A;&#x7684;&#x8D44;&#x6E90;&#x652F;&#x6301;&#x7684;&#x65B9;&#x6CD5;</li>
<li>TRACE&#xFF1A;&#x8FFD;&#x8E2A;&#x8DEF;&#x5F84;&#xFF0C;&#x7528;&#x6765;&#x786E;&#x8BA4;&#x8FDE;&#x63A5;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x3002;&#x4E0D;&#x5E38;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x5BB9;&#x6613;&#x5F15;&#x53D1; XST &#x653B;&#x51FB;&#x3002;</li>
<li>CONNECT&#xFF1A;&#x8981;&#x6C42;&#x7528;&#x96A7;&#x9053;&#x534F;&#x8BAE;&#x8FDE;&#x63A5;&#x4EE3;&#x7406;&#xFF0C;&#x5B9E;&#x73B0;&#x7528;&#x96A7;&#x9053;&#x534F;&#x8BAE;&#x8FDB;&#x884C; TCP &#x901A;&#x4FE1;&#x3002;&#x4E3B;&#x8981;&#x4F7F;&#x7528; SSL &#x548C; TLS &#x534F;&#x8BAE;&#x628A;&#x901A;&#x4FE1;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x540E;&#x7ECF;&#x7F51;&#x7EDC;&#x96A7;&#x9053;&#x4F20;&#x8F93;&#x3002;</li>
</ul>
</li>
<li><p>&#x65B9;&#x6CD5;&#x533A;&#x5206;&#x5927;&#x5C0F;&#x5199;&#xFF0C;&#x7528;&#x5927;&#x5199;&#x6765;&#x8868;&#x793A;&#xFF1B;</p>
</li>
<li>&#x5728; http &#x534F;&#x8BAE;&#x7684;&#x521D;&#x59CB;&#x7248;&#x672C;&#x91CC;&#xFF0C;&#x6BCF;&#x8FDB;&#x884C;&#x4E00;&#x6B21; HTTP &#x901A;&#x4FE1;&#x5C31;&#x8981;&#x65AD;&#x5F00;&#x4E00;&#x6B21; TCP &#x8FDE;&#x63A5;&#xFF1B;&#x4E3A;&#x4E86;&#x89E3;&#x51B3; TCP &#x8FDE;&#x63A5;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x4E86;&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#xFF08;http keep-alive&#xFF09;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EA;&#x8981;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x5C31;&#x80FD;&#x4E00;&#x6B21;&#x6027;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x4E86;&#xFF1B;&#x800C;&#x7BA1;&#x7EBF;&#x5316;&#x80FD;&#x505A;&#x5230;&#x540C;&#x4E8B;&#x5E76;&#x884C;&#x53D1;&#x9001;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x5730;&#x7B49;&#x5F85;&#x54CD;&#x5E94;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x6548;&#x7387;&#x3002;</li>
<li>&#x4FDD;&#x7559;&#x65E0;&#x72B6;&#x6001;&#x534F;&#x8BAE;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x540C;&#x65F6;&#x53C8;&#x8981;&#x89E3;&#x51B3;&#x7C7B;&#x4F3C;&#x7684;&#x77DB;&#x76FE;&#x95EE;&#x9898;&#xFF0C;&#x4E8E;&#x662F;&#x5F15;&#x5165;&#x4E86; cookie &#x6280;&#x672F;&#x3002;Cookie &#x6280;&#x672F;&#x901A;&#x8FC7;&#x5728;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E2D;&#x5199;&#x5165; cookie &#x4FE1;&#x606F;&#x6765;&#x63A7;&#x5236;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x72B6;&#x6001;&#x3002;</li>
<li>Cookie &#x4F1A;&#x6839;&#x636E;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x5185;&#x7684;&#x4E00;&#x4E2A;&#x53EB;&#x505A; Set-Cookie &#x7684;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x4FE1;&#x606F;&#xFF0C;&#x901A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x4FDD;&#x5B58; Cookie&#x3002;&#x5F53;&#x4E0B;&#x6B21;&#x5BA2;&#x6237;&#x7AEF;&#x518D;&#x5F80;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4F1A;&#x81EA;&#x52A8;&#x5728;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x4E2D;&#x52A0;&#x5165; Cookie &#x503C;&#x540E;&#x53D1;&#x9001;&#x8FC7;&#x53BB;&#x3002;</li>
<li>&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x73B0;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x8FC7;&#x6765;&#x7684; Cookie &#x540E;&#xFF0C;&#x4F1A;&#x53BB;&#x68C0;&#x67E5;&#x7A76;&#x7ADF;&#x662F;&#x4ECE;&#x54EA;&#x4E00;&#x4E2A;&#x5BA2;&#x670D;&#x7AEF;&#x53D1;&#x6765;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6BD4;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x3002;</li>
</ol>
<h2 id="&#x7B2C;&#x4E09;&#x7AE0;">&#x7B2C;&#x4E09;&#x7AE0;</h2>
<ol>
<li>&#x7528;&#x4E8E; HTTP &#x534F;&#x8BAE;&#x4EA4;&#x4E92;&#x7684;&#x4FE1;&#x606F;&#x88AB;&#x79F0;&#x4E3A; HTTP &#x62A5;&#x6587;&#x3002;</li>
<li>&#x8BF7;&#x6C42;&#x7AEF;&#x7684;&#x53EB;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#xFF0C;&#x54CD;&#x5E94;&#x7AEF;&#x7684;&#x53EB;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x3002;</li>
<li>HTTP &#x62A5;&#x6587;&#x5927;&#x81F4;&#x53EF;&#x5206;&#x4E3A;&#x62A5;&#x6587;&#x9996;&#x90E8;&#x548C;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x4E24;&#x5757;&#x3002;</li>
<li>&#x5185;&#x5BB9;&#x7F16;&#x7801;&#x6307;&#x660E;&#x5E94;&#x7528;&#x5728;&#x5B9E;&#x4F53;&#x5185;&#x5BB9;&#x4E0A;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#xFF0C;&#x5E76;&#x4FDD;&#x6301;&#x5B9E;&#x4F53;&#x4FE1;&#x606F;&#x539F;&#x6837;&#x538B;&#x7F29;&#x3002;&#x5E76;&#x7531;&#x5BA2;&#x6237;&#x7AEF;&#x8D1F;&#x8D23;&#x63A5;&#x6536;&#x548C;&#x89E3;&#x7801;&#x3002;</li>
<li><p>&#x5E38;&#x89C1;&#x7684;&#x5185;&#x5BB9;&#x7F16;&#x7801;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A;</p>
<ul>
<li>gzip(GNU zip)</li>
<li>compress(UNIX &#x7CFB;&#x7EDF;&#x7684;&#x6807;&#x51C6;&#x538B;&#x7F29;)</li>
<li>deflate(zlib)</li>
<li>identity(&#x4E0D;&#x8FDB;&#x884C;&#x7F16;&#x7801;)</li>
</ul>
</li>
<li><p>&#x5728; http &#x901A;&#x4FE1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BF7;&#x6C42;&#x7684;&#x7F16;&#x7801;&#x5B9E;&#x4F53;&#x8D44;&#x6E90;&#x5C1A;&#x672A;&#x5168;&#x90E8;&#x4F20;&#x8F93;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x662F;&#x65E0;&#x6CD5;&#x663E;&#x793A;&#x8BF7;&#x6C42;&#x9875;&#x9762;&#x7684;&#x3002;&#x5728;&#x4F20;&#x8F93;&#x5927;&#x91CF;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x628A;&#x6570;&#x636E;&#x5206;&#x5272;&#x6210;&#x591A;&#x5757;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x9010;&#x6B65;&#x663E;&#x793A;&#x9875;&#x9762;&#x3002;</p>
</li>
<li>&#x5206;&#x5757;&#x4F20;&#x8F93;&#x7F16;&#x7801;&#x662F;&#x5C06;&#x5B9E;&#x4F53;&#x5206;&#x5272;&#x6210;&#x591A;&#x4E2A;&#x5757;&#x3002;&#x6BCF;&#x4E00;&#x5757;&#x90FD;&#x4F1A;&#x7528;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6765;&#x6807;&#x8BB0;&#x5757;&#x7684;&#x5927;&#x5C0F;&#x3002;</li>
<li>&#x4EE5;&#x524D;&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x9AD8;&#x901F;&#x7684;&#x5E26;&#x5BBD;&#x8BBF;&#x95EE;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x4E0B;&#x8F7D;&#x56FE;&#x7247;&#x8D44;&#x6E90;&#x5F88;&#x8D39;&#x52B2;&#xFF0C;&#x5982;&#x679C;&#x4E0B;&#x8F7D;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x90A3;&#x5C31;&#x5FC5;&#x987B;&#x91CD;&#x5934;&#x5F00;&#x59CB;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6062;&#x590D;&#x673A;&#x5236;&#xFF0C;&#x5373;&#x80FD;&#x4ECE;&#x4E4B;&#x524D;&#x4E0B;&#x8F7D;&#x4E2D;&#x65AD;&#x5904;&#x6062;&#x590D;&#x4E0B;&#x8F7D;&#x3002;</li>
<li>&#x8981;&#x5B9E;&#x73B0;&#x4E0A;&#x8FF0;&#x529F;&#x80FD;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x4E0B;&#x8F7D;&#x7684;&#x5B9E;&#x4F53;&#x8303;&#x56F4;&#x3002;&#x6307;&#x5B9A;&#x8303;&#x56F4;&#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#x53EB;&#x505A;&#x8303;&#x56F4;&#x8BF7;&#x6C42;(Range Request)</li>
<li><p>&#x5BF9;&#x4E00;&#x4EFD; 10000 &#x5B57;&#x8282;&#x5927;&#x5C0F;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x53EA;&#x8BF7;&#x6C42; 5001 ~ 10000 &#x5B57;&#x8282;&#x5185;&#x7684;&#x8D44;&#x6E90;&#x3002;</p>
<ul>
<li>Range: bytes=5001-1000 &#x8BF7;&#x6C42; 5001-1000 &#x5B57;&#x8282;</li>
<li>Range: bytes=5001- &#x8BF7;&#x6C42; 5001 &#x5B57;&#x8282;&#x4E4B;&#x540E;&#x5168;&#x90E8;&#x7684;</li>
<li>Range: bytes=0-3000, 5000-7000 &#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5230; 3000 &#x5B57;&#x8282;&#x548C; 5000-7000 &#x5B57;&#x8282;&#x7684;&#x591A;&#x91CD;&#x8303;&#x56F4;</li>
</ul>
</li>
<li><p>&#x9488;&#x5BF9;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#x4F1A;&#x8FD4;&#x56DE; 206 &#x7684;&#x72B6;&#x6001;&#x7801;&#x3002;&#x9488;&#x5BF9;&#x591A;&#x91CD;&#x8303;&#x56F4;&#x7684;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#xFF0C;&#x54CD;&#x5E94;&#x4F1A;&#x5728;&#x9996;&#x90E8;&#x5B57;&#x6BB5;<code>Content-Type</code>&#x6807;&#x660E;<code>multipart/byteranges</code>&#x540E;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x3002;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x65E0;&#x6CD5;&#x54CD;&#x5E94;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x4F1A;&#x8FD4;&#x56DE;&#x72B6;&#x6001;&#x7801; 200 OK &#x548C;&#x5B8C;&#x6574;&#x7684;&#x5B9E;&#x4F53;&#x5185;&#x5BB9;&#x3002;</p>
</li>
<li>&#x540C;&#x4E00;&#x4E2A; web &#x7F51;&#x7AD9;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7740;&#x591A;&#x4EFD;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5BB9;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x6BD4;&#x5982;&#x4E2D;&#x6587;&#x7248;&#x548C;&#x82F1;&#x6587;&#x7248;&#x7684;&#x3002;&#x5F53;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x9ED8;&#x8BA4;&#x8BED;&#x8A00;&#x4E3A;&#x82F1;&#x8BED;&#x6216;&#x4E2D;&#x6587;&#xFF0C;&#x8BBF;&#x95EE;&#x76F8;&#x540C;&#x7684; URI &#x7684; web &#x9875;&#x9762;&#x65F6;&#xFF0C;&#x5219;&#x4F1A;&#x663E;&#x793A;&#x5BF9;&#x5E94;&#x8BED;&#x8A00;&#x7684;&#x9875;&#x9762;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x5236;&#x79F0;&#x4E3A;&#x5185;&#x5BB9;&#x534F;&#x5546;<code>Content Negotiation</code></li>
<li><p>&#x5185;&#x5BB9;&#x534F;&#x5546;&#x6307;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x6839;&#x636E;&#x54CD;&#x5E94;&#x7684;&#x8D44;&#x6E90;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x4EA4;&#x6D89;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x4F9B;&#x7ED9;&#x6700;&#x4E3A;&#x5408;&#x9002;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x5185;&#x5BB9;&#x534F;&#x5546;&#x4F1A;&#x4EE5;&#x8BED;&#x8A00;&#x3001;&#x5B57;&#x7B26;&#x96C6;&#x3001;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x7B49;&#x4E3A;&#x57FA;&#x51C6;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x3002;</p>
<p>&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x4E2D;&#x7684;&#x5982;&#x4E0B;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x5C31;&#x662F;&#x5224;&#x65AD;&#x7684;&#x57FA;&#x51C6;&#x3002;</p>
<ul>
<li>Accept</li>
<li>Accept-Charset</li>
<li>Accept-Encoding</li>
<li>Accept-Language</li>
<li>Content-Language</li>
</ul>
</li>
<li><p>&#x5185;&#x5BB9;&#x534F;&#x5546;&#x6280;&#x672F;&#x6709;&#x4EE5;&#x4E0B; 3 &#x79CD;&#x7C7B;&#x578B;&#xFF1A;</p>
<ul>
<li>&#x670D;&#x52A1;&#x5668;&#x9A71;&#x52A8;&#x534F;&#x5546;(Server-driven Negotiation)</li>
</ul>
<p>&#x7531;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x534F;&#x5546;&#x3002;&#x4EE5;&#x8BF7;&#x6C42;&#x7684;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x81EA;&#x52A8;&#x5904;&#x7406;&#x3002;&#x4F46;&#x5BF9;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x4EE5;&#x6D4F;&#x89C8;&#x5668;&#x53D1;&#x9001;&#x7684;&#x4FE1;&#x606F;&#x4F5C;&#x4E3A;&#x5224;&#x5B9A;&#x7684;&#x4F9D;&#x636E;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x4E00;&#x5B9A;&#x7B5B;&#x9009;&#x51FA;&#x6700;&#x4F18;&#x5185;&#x5BB9;</p>
<ul>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x9A71;&#x52A8;&#x534F;&#x5546;(Agent-driven Negotiation)</li>
</ul>
<p>&#x7531;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x884C;&#x534F;&#x5546;&#x3002;&#x7528;&#x6237;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x663E;&#x793A;&#x7684;&#x53EF;&#x9009;&#x9879;&#x5217;&#x8868;&#x4E2D;&#x624B;&#x52A8;&#x9009;&#x62E9;&#x3002;&#x8FD8;&#x53EF;&#x4EE5;&#x5229;&#x7528; JavaScript &#x811A;&#x672C;&#x5728; Web &#x9875;&#x9762;&#x4E0A;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x4E0A;&#x8FF0;&#x9009;&#x62E9;&#x3002;&#x6BD4;&#x5982;&#x6309; OS &#x7684;&#x7C7B;&#x578B;&#x6216;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x81EA;&#x52A8;&#x5207;&#x6362; PC &#x7248;&#x9875;&#x9762;&#x6216;&#x624B;&#x673A;&#x7248;&#x9875;&#x9762;&#x3002;</p>
<ul>
<li>&#x900F;&#x660E;&#x534F;&#x5546;(Transparent Negotiation)</li>
</ul>
<p>&#x662F;&#x670D;&#x52A1;&#x5668;&#x9A71;&#x52A8;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x9A71;&#x52A8;&#x7684;&#x7ED3;&#x5408;&#x4F53;&#xFF0C;&#x662F;&#x7531;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x5404;&#x81EA;&#x8FDB;&#x884C;&#x534F;&#x5546;&#x7684;&#x4E00;&#x79CD;&#x529E;&#x6CD5;&#x3002;</p>
</li>
</ol>
<h2 id="&#x7B2C;&#x56DB;&#x7AE0;">&#x7B2C;&#x56DB;&#x7AE0;</h2>
<ol>
<li><p>&#x72B6;&#x6001;&#x7801; 2xx</p>
<ul>
<li>200 &#x8868;&#x793A;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x6765;&#x7684;&#x8BF7;&#x6C42;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x88AB;&#x6B63;&#x5E38;&#x5904;&#x7406;&#x4E86;&#x3002;&#x5982;&#x5728;&#x4F7F;&#x7528; GET &#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5BF9;&#x5E94;&#x8BF7;&#x6C42;&#x8D44;&#x6E90;&#x7684;&#x5B9E;&#x4F53;&#x4F1A;&#x4F5C;&#x4E3A;&#x54CD;&#x5E94;&#x8FD4;&#x56DE;&#x3002;</li>
<li><p>204 &#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;&#x7684;&#x8BF7;&#x6C42;&#x5DF2;&#x6210;&#x529F;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x5728;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x5B9E;&#x4F53;&#x7684;&#x4E3B;&#x4F53;&#x90E8;&#x5206;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4E5F;&#x4E0D;&#x5141;&#x8BB8;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x5B9E;&#x4F53;&#x7684;&#x4E3B;&#x4F53;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x5728;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x5F80;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x5BF9;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x9700;&#x8981;&#x53D1;&#x9001;&#x65B0;&#x4FE1;&#x606F;&#x5185;&#x5BB9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x3002;</p>
</li>
<li><p>206 &#x8868;&#x793A;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x884C;&#x4E86;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#xFF0C;&#x800C;&#x670D;&#x52A1;&#x5668;&#x6210;&#x529F;&#x6267;&#x884C;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x7684; GET &#x8BF7;&#x6C42;&#x3002;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E2D;&#x5305;&#x542B;&#x6709; Content-Range &#x6307;&#x5B9A;&#x8303;&#x56F4;&#x7684;&#x5B9E;&#x4F53;&#x5185;&#x5BB9;&#x3002;</p>
</li>
</ul>
</li>
<li><p>&#x72B6;&#x6001;&#x7801; 3xx&#x3002;3xx &#x54CD;&#x5E94;&#x7ED3;&#x679C;&#x8868;&#x660E;&#x6D4F;&#x89C8;&#x5668;&#x9700;&#x8981;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x5904;&#x7406;&#x4EE5;&#x6B63;&#x786E;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x3002;</p>
<ul>
<li>301 &#x6C38;&#x4E45;&#x6027;&#x91CD;&#x5B9A;&#x5411;&#x3002;&#x8BE5;&#x72B6;&#x6001;&#x7801;&#x8868;&#x793A;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x5DF2;&#x88AB;&#x5206;&#x914D;&#x4E86;&#x65B0;&#x7684; URI&#xFF0C;&#x4EE5;&#x540E;&#x5E94;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#x73B0;&#x5728;&#x6240;&#x6307;&#x7684; URI&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x628A;&#x8D44;&#x6E90;&#x5BF9;&#x5E94;&#x7684; URI &#x4FDD;&#x5B58;&#x4E3A;&#x4E66;&#x7B7E;&#x4E86;&#xFF0C;&#x8FD9;&#x65F6;&#x5E94;&#x8BE5;&#x6309;<code>location</code>&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x63D0;&#x793A;&#x7684; URI &#x91CD;&#x65B0;&#x4FDD;&#x5B58;&#x3002;</li>
<li>302 &#x4E34;&#x65F6;&#x91CD;&#x5B9A;&#x5411;&#x3002;&#x8BE5;&#x72B6;&#x6001;&#x5417;&#x8868;&#x793A;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x5DF2;&#x88AB;&#x5206;&#x914D;&#x4E86;&#x65B0;&#x7684; URI&#xFF0C;&#x5E0C;&#x671B;&#x7528;&#x6237;&#x672C;&#x6B21;&#x80FD;&#x4F7F;&#x7528;&#x65B0;&#x7684; URI &#x8BBF;&#x95EE;&#x3002;</li>
<li>303 &#x8BE5;&#x72B6;&#x6001;&#x7801;&#x8868;&#x793A;&#x7531;&#x4E8E;&#x8BF7;&#x6C42;&#x5BF9;&#x5E94;&#x7684;&#x8D44;&#x6E90;&#x5B58;&#x5728;&#x7740;&#x53E6;&#x4E00;&#x4E2A; URI&#xFF0C;&#x5E94;&#x4F7F;&#x7528; GET &#x65B9;&#x6CD5;&#x5B9A;&#x5411;&#x83B7;&#x53D6;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x3002;</li>
<li>304 &#x8868;&#x793A;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x9644;&#x5E26;&#x6761;&#x4EF6;&#x7684;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5141;&#x8BB8;&#x8BF7;&#x6C42;&#x8BBF;&#x95EE;&#x8D44;&#x6E90;&#xFF0C;&#x4F46;&#x56E0;&#x53D1;&#x751F;&#x8BF7;&#x6C42;&#x672A;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x540E;&#xFF0C;&#x76F4;&#x63A5;&#x8FD4;&#x56DE; 304.</li>
<li>307 &#x4E34;&#x65F6;&#x91CD;&#x5B9A;&#x5411;&#x3002;&#x8DDF; 302 &#x6709;&#x7740;&#x76F8;&#x540C;&#x7684;&#x542B;&#x4E49;&#x3002;</li>
</ul>
</li>
<li><p>4xx &#x5BA2;&#x6237;&#x7AEF;&#x9519;&#x8BEF;&#x3002;</p>
<ul>
<li>400 Bad request &#x8868;&#x793A;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x4E2D;&#x5B58;&#x5728;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;&#x5F53;&#x9519;&#x8BEF;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x9700;&#x4FEE;&#x6539;&#x8BF7;&#x6C42;&#x7684;&#x5185;&#x5BB9;&#x540E;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3002;</li>
<li><p>401 Unauthorized &#x8868;&#x793A;&#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#x9700;&#x8981;&#x6709;&#x901A;&#x8FC7; HTTP &#x8BA4;&#x8BC1;&#xFF08;BASIC &#x8BA4;&#x8BC1;&#x3001;DIGEST &#x8BA4;&#x8BC1;&#xFF09;&#x7684;&#x8BA4;&#x8BC1;&#x4FE1;&#x606F;&#x3002;&#x53E6;&#x5916;&#x82E5;&#x4E4B;&#x524D;&#x5DF2;&#x8FDB;&#x884C;&#x8FC7; 1 &#x6B21;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x8868;&#x793A;&#x7528;&#x6237;&#x8BA4;&#x8BC1;&#x5931;&#x8D25;&#x3002;</p>
<p>&#x8FD4;&#x56DE;&#x542B;&#x6709; 401 &#x7684;&#x54CD;&#x5E94;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x9002;&#x7528;&#x4E8E;&#x88AB;&#x8BF7;&#x6C42;&#x8D44;&#x6E90;&#x7684; WWW-Authenticate &#x9996;&#x90E8;&#x7528;&#x4EE5;&#x8D28;&#x8BE2;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x3002;&#x5F53;&#x6D4F;&#x89C8;&#x5668;&#x521D;&#x6B21;&#x63A5;&#x6536;&#x5230; 401 &#x54CD;&#x5E94;&#xFF0C;&#x4F1A;&#x5F39;&#x51FA;&#x8BA4;&#x8BC1;&#x7528;&#x7684;&#x5BF9;&#x8BDD;&#x7A97;&#x53E3;</p>
</li>
<li><p>403 Forbidden &#x8868;&#x660E;&#x5BF9;&#x8BF7;&#x6C42;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;&#x88AB;&#x670D;&#x52A1;&#x5668;&#x62D2;&#x7EDD;&#x4E86;&#x3002;</p>
</li>
<li>404 Not Found &#x8BE5;&#x72B6;&#x6001;&#x7801;&#x8868;&#x660E;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x62D2;&#x7EDD;&#x8BF7;&#x6C42;&#x4E14;&#x4E0D;&#x60F3;&#x8BF4;&#x660E;&#x7406;&#x7531;&#x65F6;&#x4F7F;&#x7528;&#x3002;</li>
</ul>
</li>
<li><p>5xx &#x670D;&#x52A1;&#x5668;&#x9519;&#x8BEF;</p>
<ul>
<li>500 Internal Server Error &#x8868;&#x660E;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5728;&#x6267;&#x884C;&#x8BF7;&#x6C42;&#x65F6;&#x53D1;&#x751F;&#x4E86;&#x9519;&#x8BEF;&#x3002;</li>
<li>503 Service Unavailable &#x8868;&#x660E;&#x670D;&#x52A1;&#x5668;&#x6682;&#x65F6;&#x5904;&#x4E8E;&#x8D85;&#x8D1F;&#x8F7D;&#x6216;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x505C;&#x673A;&#x7EF4;&#x62A4;&#xFF0C;&#x73B0;&#x5728;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x3002;</li>
</ul>
</li>
</ol>
<h2 id="&#x7B2C;&#x4E94;&#x7AE0;">&#x7B2C;&#x4E94;&#x7AE0;</h2>
<ol>
<li>&#x4EE3;&#x7406;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x8F6C;&#x53D1;&#x529F;&#x80FD;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4ED6;&#x626E;&#x6F14;&#x4E86;&#x4F4D;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x95F4;&#x4EBA;&#x7684;&#x89D2;&#x8272;&#x3002;</li>
<li>&#x7F51;&#x5173;&#x662F;&#x8F6C;&#x53D1;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x5668;&#x901A;&#x4FE1;&#x6570;&#x636E;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;</li>
<li>&#x96A7;&#x9053;&#x662F;&#x5728;&#x76F8;&#x9694;&#x751A;&#x8FDC;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x4E2D;&#x8F6C;&#xFF0C;&#x5E76;&#x4FDD;&#x6301;&#x53CC;&#x65B9;&#x901A;&#x4FE1;&#x8FDE;&#x63A5;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</li>
</ol>
<p>&#x96A7;&#x9053;&#x7684;&#x76EE;&#x7684;&#x662F;&#x786E;&#x4FDD;&#x5BA2;&#x6237;&#x7AEF;&#x80FD;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x5B89;&#x5168;&#x7684;&#x901A;&#x4FE1;&#x3002;</p>
<h2 id="&#x7B2C;&#x516D;&#x7AE0;">&#x7B2C;&#x516D;&#x7AE0;</h2>
<ol>
<li><code>Content-Type</code>&#x5B57;&#x6BB5;&#x8868;&#x793A;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x7684;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;: <code>text/plain</code></li>
<li><p>4 &#x79CD; HTTP &#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;</p>
<ul>
<li><strong>General</strong> Header Fields <strong>&#x901A;&#x7528;</strong>&#x9996;&#x90E8;&#x5B57;&#x6BB5;</li>
<li>&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x548C;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E24;&#x65B9;&#x90FD;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x9996;&#x90E8;</li>
<li><strong>Request</strong> Header Fields <strong>&#x8BF7;&#x6C42;&#x9996;&#x90E8;&#x5B57;&#x6BB5;</strong></li>
<li>&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x9996;&#x90E8;&#x3002;</li>
<li><strong>Response</strong> Header Fields <strong>&#x54CD;&#x5E94;</strong>&#x9996;&#x90E8;&#x5B57;&#x6BB5;</li>
<li>&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x9996;&#x90E8;&#x3002;</li>
<li><strong>Entiry</strong> Header Fields <strong>&#x5B9E;&#x4F53;</strong>&#x9996;&#x90E8;&#x5B57;&#x6BB5;</li>
<li>&#x9488;&#x5BF9;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x548C;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x7684;&#x5B9E;&#x4F53;&#x90E8;&#x5206;&#x4F7F;&#x7528;&#x7684;&#x9996;&#x90E8;&#x3002;&#x8865;&#x5145;&#x4E86;&#x8D44;&#x6E90;&#x5185;&#x5BB9;&#x66F4;&#x65B0;&#x65F6;&#x95F4;&#x7B49;&#x4E0E;&#x5B9E;&#x4F53;&#x6709;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x3002;</li>
</ul>
</li>
<li><p>&#x901A;&#x7528;&#x9996;&#x90E8;&#x5B57;&#x6BB5;</p>
</li>
</ol>
<table>
<thead>
<tr>
<th>&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x540D;</th>
<th>&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody>
<tr>
<td>Cache-control</td>
<td>&#x63A7;&#x5236;&#x7F13;&#x5B58;&#x7684;&#x884C;&#x4E3A;</td>
</tr>
</tbody>
</table>
<ol>
<li><p>&#x901A;&#x7528;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x662F;&#x6307;&#xFF0C;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x548C;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x53CC;&#x65B9;&#x90FD;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x9996;&#x90E8;&#x3002;</p>
<ul>
<li>&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x9996;&#x90E8;&#x5B57;&#x6BB5; Cache-control &#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x5C31;&#x80FD;&#x64CD;&#x4F5C;&#x7F13;&#x5B58;&#x7684;&#x5DE5;&#x4F5C;&#x673A;&#x5236; &#x3002;</li>
<li>&#x5728; Cache-Control &#x4E2D;&#xFF0C;&#x7F13;&#x5B58;&#x54CD;&#x5E94;&#x6307;&#x4EE4;</li>
<li>public &#x6307;&#x4EE4; &#x8868;&#x660E;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x4E5F;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7F13;&#x5B58;&#x3002;</li>
<li>private &#x6307;&#x4EE4;&#x8868;&#x793A;&#x4EE5;&#x7279;&#x5B9A;&#x7684;&#x7528;&#x6237;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x3002;</li>
<li>&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x5BF9;&#x8BE5;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x8D44;&#x6E90;&#x7F13;&#x5B58;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x53D1;&#x9001;&#x8FC7;&#x6765;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x5219;&#x4E0D;&#x4F1A;&#x8FD4;&#x56DE;&#x7F13;&#x5B58;&#x3002;</li>
<li>no-cache &#x6307;&#x4EE4;&#x662F;&#x5F3A;&#x5236;&#x5411;&#x539F;&#x670D;&#x52A1;&#x5668;&#x518D;&#x6B21;&#x9A8C;&#x8BC1;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x8FD4;&#x56DE;&#x8FC7;&#x671F;&#x7684;&#x8D44;&#x6E90;&#x3002;<ul>
<li>&#x4ECE;&#x670D;&#x52A1;&#x7AEF;&#x8FD4;&#x56DE;&#x6765;&#x8FC7;&#x7684;&#x5E26;&#x53C2;&#x6570;&#x7684; no-cache&#xFF0C;&#x6307;&#x5B9A;&#x53C2;&#x6570;&#x503C;&#x7684;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x5BF9;&#x5E94;&#x7684;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x5C31;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x3002;&#x65E0;&#x53C2;&#x6570;&#x503C;&#x7684;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x3002;</li>
</ul>
</li>
<li>no-store &#x89C4;&#x5B9A;&#x7F13;&#x5B58;&#x4E0D;&#x80FD;&#x518D;&#x672C;&#x5730;&#x50A8;&#x5B58;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x7684;&#x4EFB;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x4E0D;&#x8FDB;&#x884C;&#x7F13;&#x5B58;&#x3002;</li>
<li>max-age &#x6570;&#x503C;&#x4EE3;&#x8868;&#x8D44;&#x6E90;&#x4FDD;&#x5B58;&#x4E3A;&#x7F13;&#x5B58;&#x7684;&#x6700;&#x957F;&#x65F6;&#x95F4;&#x3002;</li>
<li>min-fresh &#x8981;&#x6C42;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x81F3;&#x5C11;&#x8FD8;&#x672A;&#x8FC7;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x8D85;&#x8FC7;&#x6307;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5219;&#x65E0;&#x6CD5;&#x4F5C;&#x4E3A;&#x54CD;&#x5E94;&#x8FD4;&#x56DE;&#x3002;</li>
<li>max-stale &#x53EF;&#x6307;&#x793A;&#x7F13;&#x5B58;&#x8D44;&#x6E90;&#xFF0C;&#x5373;&#x4F7F;&#x8FC7;&#x671F;&#x4E5F;&#x7167;&#x6837;&#x63A5;&#x6536;&#x3002;<ul>
<li>&#x6307;&#x5B9A;&#x6570;&#x503C;&#xFF0C;&#x5219;&#x5728;&#x6570;&#x503C;&#x4E4B;&#x5185;&#x7F13;&#x5B58;&#x90FD;&#x6709;&#x6548;</li>
<li>&#x4E0D;&#x6307;&#x5B9A;&#x6570;&#x503C;&#xFF0C;&#x5219;&#x65E0;&#x8BBA;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x7F13;&#x5B58;&#x90FD;&#x6709;&#x6548;&#x3002;</li>
</ul>
</li>
<li>only-if-cached &#x8868;&#x793A;&#x5BA2;&#x6237;&#x7AEF;&#x4EC5;&#x5728;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x76EE;&#x6807;&#x5B58;&#x5728;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x4F1A;&#x8981;&#x6C42;&#x5176;&#x8FD4;&#x56DE;&#x3002;</li>
<li>must-revalidate &#x4EE3;&#x7406;&#x4F1A;&#x5411;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x518D;&#x6B21;&#x9A8C;&#x8BC1;&#x5373;&#x5C06;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x7F13;&#x5B58;&#x76EE;&#x524D;&#x662F;&#x5426;&#x4ECD;&#x7136;&#x6709;&#x6548;&#x3002;</li>
<li>proxy-revalidate &#x6307;&#x4EE4;&#x8981;&#x6C42;&#x6240;&#x6709;&#x7684;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x5728;&#x63A5;&#x6536;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x5E26;&#x6709;&#x8BE5;&#x6307;&#x4EE4;&#x7684;&#x8BF7;&#x6C42;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x518D;&#x6B21;&#x9A8C;&#x8BC1;&#x7F13;&#x5B58;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002;</li>
<li>no-transform &#x89C4;&#x5B9A;&#x65E0;&#x8BBA;&#x662F;&#x8BF7;&#x6C42;&#x8FD8;&#x662F;&#x54CD;&#x5E94;&#x4E2D;&#xFF0C;&#x7F13;&#x5B58;&#x90FD;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x7684;&#x5A92;&#x4F53;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x9632;&#x6B62;&#x7F13;&#x5B58;&#x6216;&#x4EE3;&#x7406;&#x538B;&#x7F29;&#x56FE;&#x7247;&#x7B49;&#x7C7B;&#x4F3C;&#x64CD;&#x4F5C;</li>
<li>Connection &#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x4EE3;&#x7406;&#x4E0D;&#x518D;&#x8F6C;&#x53D1;&#x7684;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x3002;&#x53EF;&#x4EE5;<strong>&#x7BA1;&#x7406;&#x6301;&#x4E45;&#x8FDE;&#x63A5;</strong></li>
<li>HTTP/1.1 &#x9ED8;&#x8BA4;&#x8FDE;&#x63A5;&#x90FD;&#x662F;&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#xFF08;keep-alive&#xFF09;&#xFF0C;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x60F3;&#x660E;&#x786E;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x5219;&#x6307;&#x5B9A; Connection &#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x4E3A;<code>close</code></li>
<li>Date &#x8868;&#x660E;&#x521B;&#x5EFA; HTTP &#x62A5;&#x6587;&#x7684;&#x65E5;&#x671F;&#x548C;&#x65F6;&#x95F4;&#x3002;</li>
<li>Trailer &#x4F1A;&#x4E8B;&#x5148;&#x8BF4;&#x660E;&#x5728;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x540E;&#x8BB0;&#x5F55;&#x4E86;&#x54EA;&#x4E9B;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x3002;</li>
<li>Transfer-Encoding &#x89C4;&#x5B9A;&#x4E86;&#x4F20;&#x8F93;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x65F6;&#x91C7;&#x7528;&#x7684;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x3002;</li>
<li>Upgrade &#x7528;&#x4E8E;&#x68C0;&#x6D4B; http &#x534F;&#x8BAE;&#x53CA;&#x5176;&#x4ED6;&#x534F;&#x8BAE;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;</li>
<li>Via &#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x7528;&#x4E8E;&#x8FFD;&#x8E2A;&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x7684;&#x4F20;&#x8F93;&#x8DEF;&#x5F84;&#x3002;</li>
<li>Warning &#x901A;&#x5E38;&#x4F1A;&#x544A;&#x77E5;&#x7528;&#x6237;&#x4E00;&#x4E9B;&#x4E0E;&#x7F13;&#x5B58;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x7684;&#x8B66;&#x544A;&#x3002;&#x683C;&#x5F0F;&#x4E3A;&#xFF1A;<blockquote>
<p>Warning: [&#x8B66;&#x544A;&#x7801;][&#x8B66;&#x544A;&#x7684;&#x4E3B;&#x673A;&#xFF1A;&#x7AEF;&#x53E3;&#x53F7;] &#x201C;[&#x8B66;&#x544A;&#x7684;&#x5185;&#x5BB9;]&#x201D; &#xFF08;[&#x65E5;&#x671F;&#x548C;&#x4E8B;&#x4EF6;]&#xFF09;</p>
</blockquote>
</li>
</ul>
</li>
<li><p>&#x8BF7;&#x6C42;&#x9996;&#x90E8;&#x5B57;&#x6BB5;</p>
<ul>
<li>Accept &#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x53EF;&#x901A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x80FD;&#x591F;&#x5904;&#x7406;&#x7684;&#x5A92;&#x4F53;&#x7C7B;&#x578B;&#x53CA;&#x5A92;&#x4F53;&#x7C7B;&#x578B;&#x7684;&#x76F8;&#x5BF9;&#x4F18;&#x5148;&#x7EA7;&#x3002;</li>
<li>&#x60F3;&#x8981;&#x7ED9;&#x663E;&#x793A;&#x7684;&#x5A92;&#x4F53;&#x7C7B;&#x578B;&#x589E;&#x52A0;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5219;&#x4F7F;&#x7528; q=&#x6765;&#x989D;&#x5916;&#x8868;&#x793A;&#x6743;&#x91CD;&#x503C;&#xFF0C;&#x7528;<code>&#xFF1B;</code>&#x9694;&#x79BB;&#x3002;&#x6743;&#x91CD;&#x503C; q &#x7684;&#x8303;&#x56F4;&#x4E3A; 0~1&#xFF0C;&#x9ED8;&#x8BA4;&#x6743;&#x91CD;&#x4E3A; q=1.0&#x3002;</li>
<li>&#x5F53;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4F9B;&#x591A;&#x79CD;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x5C06;&#x4F1A;&#x9996;&#x5148;&#x8FD4;&#x56DE;&#x6743;&#x91CD;&#x503C;&#x6700;&#x9AD8;&#x7684;&#x5A92;&#x4F53;&#x7C7B;&#x578B;&#x3002;</li>
<li>Accept-Charset &#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x53EF;&#x7528;&#x6765;&#x901A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x652F;&#x6301;&#x7684;&#x5B57;&#x7B26;&#x96C6;&#x53CA;&#x5B57;&#x7B26;&#x96C6;&#x7684;&#x76F8;&#x5BF9;&#x4F18;&#x5148;&#x987A;&#x5E8F;&#x3002;&#x53EF;&#x6307;&#x5B9A;&#x6743;&#x91CD;&#x503C; q &#x6765;&#x8868;&#x793A;&#x76F8;&#x5BF9;&#x4F18;&#x5148;&#x7EA7;&#x3002;</li>
<li>Accept-Encoding &#x7528;&#x6765;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x652F;&#x6301;&#x7684;&#x5185;&#x5BB9;&#x7F16;&#x7801;&#x53CA;&#x5185;&#x5BB9;&#x7F16;&#x7801;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x987A;&#x5E8F;&#x3002;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x6027;&#x6307;&#x5B9A;&#x591A;&#x79CD;&#x7F16;&#x7801;&#x3002;&#x53EF;&#x4EE5;&#x91C7;&#x7528; q &#x6765;&#x8868;&#x793A;&#x6743;&#x91CD;&#x503C;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;<code>*</code>&#x6765;&#x8868;&#x793A;&#x4EFB;&#x610F;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;</li>
<li>gzip (GNU zip)</li>
<li>compress</li>
<li>deflate</li>
<li><p>identity &#x4E0D;&#x6267;&#x884C;&#x538B;&#x7F29;&#x6216;&#x4E0D;&#x4F1A;&#x53D8;&#x5316;&#x7684;&#x9ED8;&#x8BA4;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;</p>
<pre><code>Accept-Encoding: gzip, deflate, br
</code></pre></li>
<li><p>Accept-Language &#x7528;&#x6765;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x80FD;&#x591F;&#x5904;&#x7406;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x96C6;&#xFF0C;&#x4EE5;&#x53CA;&#x76F8;&#x5BF9;&#x4F18;&#x5148;&#x7EA7;&#x3002;&#x53EF;&#x6307;&#x5B9A;&#x591A;&#x79CD;&#x8BED;&#x8A00;&#x96C6;&#x3002;&#x7528; q &#x6765;&#x8868;&#x793A;&#x6743;&#x91CD;&#x503C;&#xFF0C;&#x6709;&#x9650;&#x8FD4;&#x56DE;&#x6743;&#x91CD;&#x503C;&#x9AD8;&#x7684;&#x3002;</p>
<pre><code>accept-language: zh-CN,zh;q=0.9
</code></pre></li>
<li><p>Authorization &#x7528;&#x6765;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x7684;&#x8BA4;&#x8BC1;&#x4FE1;&#x606F;&#x3002;</p>
<pre><code>Authorization: OLS:32pnW+rxXwSMkePCo3dIjfmyzvg=
</code></pre></li>
<li><p>Expect &#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528; expect &#x5B57;&#x6BB5;&#x6765;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x671F;&#x671B;&#x51FA;&#x73B0;&#x7684;&#x67D0;&#x79CD;&#x7279;&#x5B9A;&#x884C;&#x4E3A;&#x3002;</p>
</li>
<li>From &#x7528;&#x6765;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x7684;&#x7528;&#x6237;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7684;&#x5730;&#x5740;&#x3002;</li>
<li>Host &#x4F1A;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x6240;&#x5904;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x4E3B;&#x673A;&#x540D;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#x3002;&#x5982;&#x679C;&#x76F8;&#x540C;&#x7684; ip &#x5730;&#x5740;&#x4E0B;&#x90E8;&#x7F72;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x57DF;&#x540D;&#xFF0C;&#x90A3;&#x4E48;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x662F;&#x54EA;&#x4E2A;&#x57DF;&#x540D;&#x5BF9;&#x5E94;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x6240;&#x4EE5;&#x5C31;&#x9700;&#x8981; host &#x6765;&#x6307;&#x51FA;&#x8BF7;&#x6C42;&#x7684;&#x4E3B;&#x673A;&#x540D;&#x3002;</li>
<li>If-XXX &#x8FD9;&#x79CD;&#x6837;&#x5F0F;&#x7684;&#x8BF7;&#x6C42;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#xFF0C;&#x90FD;&#x53EF;&#x79F0;&#x4E3A;&#x6761;&#x4EF6;&#x8BF7;&#x6C42;&#x3002;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;&#x5230;&#x9644;&#x5E26;&#x6761;&#x4EF6;&#x7684;&#x8BF7;&#x6C42;&#x540E;&#xFF0C;&#x53EA;&#x6709;&#x5224;&#x65AD;&#x6307;&#x5B9A;&#x6761;&#x4EF6;&#x4E3A;&#x771F;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x6267;&#x884C;&#x8BF7;&#x6C42;&#x3002;</li>
<li>If-Modified-Since &#x4F1A;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5728;&#x6307;&#x5B9A;&#x7684;&#x503C;&#x4E4B;&#x540E;&#x66F4;&#x65B0;&#x8FC7;&#x8D44;&#x6E90;&#xFF0C;&#x5219;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x3002;&#x5982;&#x679C;&#x5728;&#x4E4B;&#x540E;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#x8FC7;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x72B6;&#x6001;&#x7801; 304&#x3002;</li>
<li>If-Unmodified-Since &#x4E0E; If-Modified-Since &#x76F8;&#x53CD;</li>
<li>If-None-Match &#x8DDF; If-Match &#x76F8;&#x53CD;</li>
<li>If-Range &#x5B57;&#x6BB5;&#x82E5;&#x662F;&#x8DDF; ETag &#x503C;&#x6216;&#x66F4;&#x65B0;&#x7684;&#x65E5;&#x671F;&#x65F6;&#x95F4;&#x5339;&#x914D;&#x4E00;&#x81F4;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F5C;&#x4E3A;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#x5904;&#x7406;&#x3002;&#x5426;&#x5219;&#x8FD4;&#x56DE;&#x5168;&#x4F53;&#x8D44;&#x6E90;&#x3002;</li>
<li>Max-Forwards &#x8BF7;&#x6C42;&#x7ECF;&#x8FC7;&#x591A;&#x53F0;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x8F6C;&#x53D1;&#x65F6;&#xFF0C;&#x6BCF;&#x8F6C;&#x53D1;&#x4E00;&#x6B21;&#xFF0C;Max-Forwards &#x7684;&#x503C;&#x5C31;&#x51CF; 1&#xFF0C;&#x5F53;&#x4E3A; 0 &#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#x3002;</li>
<li>Proxy-Authorization &#x63A5;&#x6536;&#x5230;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x6765;&#x7684;&#x8BA4;&#x8BC1;&#x8D28;&#x8BE2;&#x65F6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4F1A;&#x53D1;&#x9001;&#x5305;&#x542B;&#x9996;&#x90E8;&#x5B57;&#x6BB5; Proxy-Authorization &#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x4EE5;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x8BA4;&#x8BC1;&#x6240;&#x9700;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x53D1;&#x751F;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x4EE3;&#x7406;&#x4E4B;&#x95F4;&#x3002;</li>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x8BA4;&#x8BC1;&#xFF0C;&#x4F7F;&#x7528; Authorization &#x53EF;&#x8D77;&#x5230;&#x76F8;&#x540C;&#x7684;&#x4F5C;&#x7528;</li>
<li>Range &#x6307;&#x5B9A;&#x8303;&#x56F4;&#x7684;&#x8D44;&#x6E90;&#x8BF7;&#x6C42;&#x3002;</li>
<li>&#x80FD;&#x591F;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x8FD4;&#x56DE;&#x72B6;&#x6001;&#x7801; 206</li>
<li><p>&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x8BE5;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD4;&#x56DE; 200 &#x53CA;&#x5168;&#x90E8;&#x8D44;&#x6E90;</p>
<pre><code>Range: bytes=5001-10000
</code></pre></li>
<li><p>Referer &#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x8BF7;&#x6C42;&#x8D44;&#x6E90;&#x7684;&#x539F;&#x59CB; URI&#xFF08;&#x8DEF;&#x5F84;&#xFF09;&#x3002;</p>
</li>
<li>TE &#x4F1A;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x80FD;&#x591F;&#x5904;&#x7406;&#x54CD;&#x5E94;&#x7684;<strong>&#x4F20;&#x8F93;&#x7F16;&#x7801;&#x65B9;&#x5F0F;</strong>&#x53CA;&#x76F8;&#x5BF9;&#x4F18;&#x5148;&#x7EA7;&#x3002;</li>
<li>User-Agent &#x4F1A;&#x5C06;&#x521B;&#x5EFA;&#x8BF7;&#x6C42;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x540D;&#x79F0;&#x7B49;&#x4FE1;&#x606F;&#x4F20;&#x8FBE;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x3002;</li>
<li>&#x5982;&#x679C;&#x7ECF;&#x8FC7;&#x4EE3;&#x7406;&#xFF0C;&#x90A3;&#x4E48;&#x4E2D;&#x95F4;&#x4E5F;&#x5F88;&#x53EF;&#x80FD;&#x88AB;&#x6DFB;&#x52A0;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x7684;&#x540D;&#x79F0;&#x3002;</li>
</ul>
</li>
<li><p>&#x54CD;&#x5E94;&#x9996;&#x90E8;&#x5B57;&#x6BB5;</p>
<ul>
<li>Accept-Ranges &#x7528;&#x6765;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;<strong>&#x662F;&#x5426;&#x80FD;&#x5904;&#x7406;&#x8303;&#x56F4;&#x8BF7;&#x6C42;</strong>&#x3002;</li>
<li>&#x6307;&#x5B9A;&#x4E24;&#x79CD;&#x503C;&#xFF0C;&#x53EF;&#x5904;&#x7406;&#x4E3A;<code>bytes</code>&#xFF0C;&#x53CD;&#x4E4B;&#x5219;&#x4E3A;<code>none</code>&#x3002;</li>
<li><p>Age &#x80FD;&#x591F;&#x544A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x5728;&#x591A;&#x4E45;&#x524D;&#x521B;&#x5EFA;&#x4E86;&#x54CD;&#x5E94;&#x3002;&#x5355;&#x4F4D;&#x4E3A;&#x79D2;&#x3002;</p>
<pre><code>Age: 1941638
</code></pre></li>
<li><p>ETag &#x80FD;&#x544A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x5B9E;&#x4F53;&#x6807;&#x8BC6;&#x3002;&#x5C06;&#x8D44;&#x6E90;&#x4EE5;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x505A;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5F53;&#x8D44;&#x6E90;&#x66F4;&#x65B0;&#x65F6;&#xFF0C;ETag &#x503C;&#x4E5F;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x3002;</p>
</li>
<li>Location &#x53EF;&#x4EE5;&#x5C06;&#x54CD;&#x5E94;&#x63A5;&#x6536;&#x65B9;&#x5F15;&#x5BFC;&#x81F3;&#x67D0;&#x4E2A;&#x4E0E;&#x8BF7;&#x6C42; URI &#x4F4D;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x8D44;&#x6E90;&#x3002;</li>
<li>Proxy-Authenticate &#x4F1A;&#x628A;&#x7531;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x6240;&#x8981;&#x6C42;&#x7684;&#x8BA4;&#x8BC1;&#x4FE1;&#x606F;&#x53D1;&#x9001;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</li>
<li>Retry-After &#x544A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x76D6;&#x5728;&#x591A;&#x4E45;&#x4E4B;&#x540E;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3002;</li>
<li>Server &#x544A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x5F53;&#x524D;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5B89;&#x88C5;&#x7684; HTTP &#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4FE1;&#x606F;&#x3002;</li>
<li><p>Vary &#x53EF;&#x5BF9;&#x7F13;&#x5B58;&#x8FDB;&#x884C;&#x63A7;&#x5236;&#xFF0C;&#x5982;&#x679C;&#x6307;&#x5B9A;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#xFF0C;&#x4E0E;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x76F8;&#x540C;&#xFF0C;&#x5219;&#x76F4;&#x63A5;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5148;&#x4ECE;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x83B7;&#x53D6;&#x8D44;&#x6E90;&#x540E;&#x624D;&#x80FD;&#x4F5C;&#x4E3A;&#x54CD;&#x5E94;&#x8FD4;&#x56DE;&#x3002;</p>
<pre><code>Vary: Accept-Encoding
</code></pre></li>
<li><p>&#x9996;&#x90E8;&#x5B57;&#x6BB5; WWW-Authenticate &#x7528;&#x4E8E; HTTP &#x8BA4;&#x8BC1;&#x8BBF;&#x95EE;&#x3002;&#x4ED6;&#x4F1A;&#x544A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x9002;&#x7528;&#x8BBF;&#x95EE;&#x8BF7;&#x6C42; URI &#x6240;&#x6307;&#x5B9A;&#x8D44;&#x6E90;&#x7684;&#x8BA4;&#x8BC1;&#x65B9;&#x6848;&#xFF08;Basic &#x6216; Digest&#xFF09;&#x548C;&#x5E26;&#x53C2;&#x6570;&#x63D0;&#x793A;&#x7684;&#x8D28;&#x8BE2;&#x3002;</p>
</li>
</ul>
</li>
<li><p>&#x5B9E;&#x4F53;&#x9996;&#x90E8;&#x5B57;&#x6BB5;</p>
<ul>
<li>Allow &#x901A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x80FD;&#x591F;&#x652F;&#x6301; Request &#x6307;&#x5B9A;&#x8D44;&#x6E90;&#x7684;&#x6240;&#x6709; HTTP &#x65B9;&#x6CD5;&#x3002;</li>
<li>Content-Type &#x6307;&#x5B9A;&#x5185;&#x5BB9;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x3002;&#x5185;&#x5BB9;&#x7F16;&#x7801;&#x662F;&#x6307;&#x5728;&#x4E0D;&#x4E22;&#x5931;&#x5B9E;&#x4F53;&#x4FE1;&#x606F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6240;&#x8FDB;&#x884C;&#x7684;&#x538B;&#x7F29;&#x3002;</li>
<li>Content-Language &#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x3002;</li>
<li>Content-length &#x8868;&#x660E;&#x4E86;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x90E8;&#x5206; &#x7684;&#x5927;&#x5C0F;&#x3002;</li>
<li>Content-location &#x8868;&#x793A;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x8FD4;&#x56DE;&#x8D44;&#x6E90;&#x5BF9;&#x5E94;&#x7684; URI</li>
<li><p>Content-MD5 &#x662F;&#x4E00;&#x4E32;&#x7531; MD5 &#x7B97;&#x6CD5;&#x751F;&#x6210;&#x7684;&#x503C;&#xFF0C;&#x5176;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x68C0;&#x67E5;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x662F;&#x5426;&#x4FDD;&#x6301;&#x5B8C;&#x6574;&#xFF0C;&#x4EE5;&#x53CA;&#x786E;&#x8BA4;&#x4F20;&#x8F93;&#x5230;&#x8FBE;&#x3002;</p>
<pre><code>Content-MD5: d0c827071e3b6ca84004e4734b36537b
</code></pre></li>
<li><p>Content-Range &#x8303;&#x56F4;&#x8BF7;&#x6C42;&#x3002;</p>
<pre><code>

</code></pre></li>
<li><p>Content-Type &#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x5185;&#x5BF9;&#x8C61;&#x7684;&#x5A92;&#x4F53;&#x7C7B;&#x578B;&#x3002;</p>
<pre><code>Content-Type: text/html; charset=utf-8
</code></pre></li>
<li><p>Expires &#x4F1A;&#x5C06;&#x8D44;&#x6E90;&#x5931;&#x6548;&#x7684;&#x65E5;&#x671F;&#x544A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<pre><code>Expires: Sat, 09 Nov 2019 07:47:32 GMT
</code></pre></li>
<li><p>Last-Modified &#x6307;&#x660E;&#x8D44;&#x6E90;&#x6700;&#x7EC8;&#x4FEE;&#x6539;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<pre><code>Last-Modified: Sat, 09 Nov 2019 07:42:52 GMT
</code></pre></li>
</ul>
</li>
<li><p>Cookie &#x7684;&#x5DE5;&#x4F5C;&#x673A;&#x5236;&#x662F;&#x7528;&#x6237;&#x8BC6;&#x522B;&#x53CA;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x3002;web &#x7F51;&#x7AD9;&#x4E3A;&#x4E86;&#x7BA1;&#x7406;&#x5BA2;&#x6237;&#x7684;&#x72B6;&#x6001;&#x4F1A;&#x901A;&#x8FC7; web &#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x628A;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x4E34;&#x65F6;&#x5199;&#x5165;&#x7528;&#x6237;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x3002;&#x63A5;&#x7740;&#x5F53;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x8BE5; web &#x7F51;&#x7AD9;&#x65F6;&#xFF0C;&#x53EF;&#x901A;&#x8FC7;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x53D6;&#x56DE;&#x4E4B;&#x524D;&#x5B58;&#x653E;&#x7684; Cookie</p>
<ul>
<li>expires &#x6307;&#x5B9A;&#x6D4F;&#x89C8;&#x5668;&#x53EF;&#x53D1;&#x9001; Cookie &#x7684;&#x6709;&#x6548;&#x671F;&#x3002;</li>
<li>path &#x53EF;&#x7528;&#x4E8E;&#x9650;&#x5236;&#x6307;&#x5B9A; Cookie &#x7684;&#x53D1;&#x9001;&#x8303;&#x56F4;&#x7684;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x3002;</li>
<li>domain &#x5982;&#xFF1A;&#x6307;&#x5B9A; example.com&#xFF0C;&#x9664;&#x4E86; example.com &#x5916;&#xFF0C;www.example.com &#x6216; www2.example.com &#x7B49;&#x90FD;&#x53EF;&#x4EE5;&#x53D1;&#x9001; Cookie&#x3002;</li>
<li>&#x56E0;&#x6B64;&#xFF0C;&#x9664;&#x4E86;&#x9488;&#x5BF9;&#x5177;&#x4F53;&#x6307;&#x5B9A;&#x7684;&#x591A;&#x4E2A;&#x57DF;&#x540D;&#x53D1;&#x9001; cookie &#x5916;&#xFF0C;&#x4E0D;&#x6307;&#x5B9A; domain &#x5C5E;&#x6027;&#x663E;&#x5F97;&#x66F4;&#x5B89;&#x5168;&#x3002;</li>
<li>secure &#x5C5E;&#x6027;&#x7528;&#x4E8E;&#x9650;&#x5236; web &#x9875;&#x9762;&#x4EC5;&#x5728; https &#x5B89;&#x5168;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x53D1;&#x9001; cookie&#x3002;</li>
<li>&#x5F53;&#x7701;&#x7565;&#x65F6;&#xFF0C;&#x4E0D;&#x8BBA; http &#x548C; https &#x90FD;&#x4F1A;&#x5BF9; cookie &#x8FDB;&#x884C;&#x56DE;&#x6536;&#x3002;</li>
<li>HttpOnly &#x5B83;&#x4F7F; jsvascript &#x811A;&#x672C;&#x65E0;&#x6CD5;&#x83B7;&#x5F97; Cookie&#x3002;&#x5176;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8DE8;&#x7AD9;&#x811A;&#x672C;&#x653B;&#x51FB;&#xFF08;Cross-site-scriping, XSS&#xFF09;&#x5BF9; Cookie &#x7684;&#x4FE1;&#x606F;&#x7A83;&#x53D6;&#x3002;</li>
<li>&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#x540E;&#xFF0C;web &#x9875;&#x9762;&#x5185;&#x8FD8;&#x53EF;&#x4EE5;&#x5BF9; Cookie &#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x4F7F;&#x7528; JavaScript &#x7684;<code>document.cookie</code>&#x5C31;&#x65E0;&#x6CD5;&#x8BFB;&#x53D6;&#x9644;&#x52A0; httponly &#x5C5E;&#x6027;&#x540E;&#x7684;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x5728; XSS &#x4E2D;&#x5229;&#x7528; js &#x52AB;&#x6301; Cookie &#x4E86;&#x3002;</li>
</ul>
</li>
<li><p>&#x5176;&#x4ED6;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x3002;http &#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x662F;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x6269;&#x5C55;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5728; web &#x670D;&#x52A1;&#x5668;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5E94;&#x7528;&#x4E0A;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x5404;&#x79CD;&#x975E;&#x6807;&#x51C6;&#x7684;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x3002;&#xFF0C;<code>X-XSS-Protection</code>, <code>DNT</code>, <code>P3P</code>&#x3002;</p>
<ul>
<li>X-Frame-Options &#x5C5E;&#x4E8E; http &#x76F8;&#x5E94;&#x9996;&#x90E8;&#xFF0C;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x7F51;&#x7AD9;&#x5185;&#x5BB9;&#x5728;&#x5176;&#x4ED6; web &#x7F51;&#x7AD9;&#x7684; Frame &#x6807;&#x7B7E;&#x5185;&#x7684;&#x663E;&#x793A;&#x95EE;&#x9898;&#x3002;&#x4E3B;&#x8981;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x70B9;&#x51FB;&#x52AB;&#x6301;&#xFF08;clickjacking&#xFF09;&#x3002;</li>
<li>DENY&#xFF1A;&#x62D2;&#x7EDD;</li>
<li><p>SAMEORIGIN&#xFF1A;&#x4EC5;&#x540C;&#x6E90;&#x57DF;&#x540D;&#x4E0B;&#x7684;&#x9875;&#x9762;&#x5339;&#x914D;&#x65F6;&#x8BB8;&#x53EF;&#x3002;</p>
<pre><code>x-frame-options: SAMEORIGIN
</code></pre></li>
<li><p>x-xss-protection &#x9488;&#x5BF9;&#x8DE8;&#x7AD9;&#x811A;&#x672C;&#x653B;&#x51FB;(XSS)&#x7684;&#x4E00;&#x79CD;&#x5BF9;&#x7B56;&#xFF0C;&#x7528;&#x6237;&#x63A7;&#x5236;&#x6D4F;&#x89C8;&#x5668; XSS &#x9632;&#x62A4;&#x673A;&#x5236;&#x7684;&#x5F00;&#x5173;&#x3002;</p>
</li>
<li>0&#xFF1A;&#x5C06; XSS &#x8FC7;&#x6EE4;&#x8BBE;&#x7F6E;&#x6210;&#x65E0;&#x6548;&#x72B6;&#x6001;</li>
<li>1&#xFF1A;&#x5C06; XSS &#x8FC7;&#x6EE4;&#x8BBE;&#x7F6E;&#x6210;&#x6709;&#x6548;&#x72B6;&#x6001;</li>
<li>DNT &#xFF08;do noet track&#xFF09;&#x4E3A;&#x62D2;&#x7EDD;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x88AB;&#x6536;&#x96C6;&#xFF0C;&#x662F;&#x8868;&#x793A;&#x62D2;&#x7EDD;&#x88AB;&#x7CBE;&#x51C6;&#x5E7F;&#x544A;&#x8FFD;&#x8E2A;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</li>
<li>0&#xFF1A;&#x540C;&#x610F;&#x88AB;&#x8FFD;&#x8E2A;</li>
<li>1&#xFF1A;&#x62D2;&#x7EDD;&#x88AB;&#x8FFD;&#x8E2A;</li>
<li>P3P &#x53EF;&#x4EE5;&#x8BA9; web &#x7F51;&#x7AD9;&#x4E0A;&#x7684;&#x4E2A;&#x4EBA;&#x9690;&#x79C1;&#x53D8;&#x6210;&#x4E00;&#x79CD;&#x4EC5;&#x4F9B;&#x7A0B;&#x5E8F;&#x53EF;&#x7406;&#x89E3;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x4FDD;&#x62A4;&#x7528;&#x6237;&#x9690;&#x79C1;&#x7684;&#x76EE;&#x7684;&#x3002;</li>
</ul>
</li>
<li><p>&#x5728; http &#x7684;&#x591A;&#x79CD;&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x7ED9;&#x975E;&#x6807;&#x51C6;&#x53C2;&#x6570;&#x52A0;&#x4E0A;&#x524D;&#x7F00; X-&#xFF0C;&#x7528;&#x6765;&#x533A;&#x522B;&#x4E8E;&#x6807;&#x51C6;&#x53C2;&#x6570;&#x3002;</p>
</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="javaScript高级程序设计.html" class="navigation navigation-prev " aria-label="Previous page: JavaScript 高级程序设计">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="高性能JavaScript.html" class="navigation navigation-next " aria-label="Next page: 高性能JavaScript">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"图解HTTP","level":"1.3","depth":1,"next":{"title":"高性能JavaScript","level":"1.4","depth":1,"path":"book/高性能JavaScript.md","ref":"book/高性能JavaScript.md","articles":[]},"previous":{"title":"JavaScript 高级程序设计","level":"1.2","depth":1,"path":"book/javaScript高级程序设计.md","ref":"book/javaScript高级程序设计.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"book/图解HTTP.md","mtime":"2020-03-04T12:56:50.170Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-08T15:19:09.031Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

