
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>高性能JavaScript · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="响应式web设计html5和css3实战.html" />
    
    
    <link rel="prev" href="图解HTTP.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="javaScript高级程序设计.html">
            
                <a href="javaScript高级程序设计.html">
            
                    
                    JavaScript 高级程序设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="图解HTTP.html">
            
                <a href="图解HTTP.html">
            
                    
                    图解HTTP
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="高性能JavaScript.html">
            
                <a href="高性能JavaScript.html">
            
                    
                    高性能JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="响应式web设计html5和css3实战.html">
            
                <a href="响应式web设计html5和css3实战.html">
            
                    
                    响应式web设计html5和css3实战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../note/React.html">
            
                <a href="../note/React.html">
            
                    
                    React笔记
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../note/javascriptFun.html">
            
                <a href="../note/javascriptFun.html">
            
                    
                    JavaScript常用函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="代码整洁之道.html">
            
                <a href="代码整洁之道.html">
            
                    
                    代码整洁之道
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >高性能JavaScript</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7B2C;&#x4E00;&#x7AE0;">&#x7B2C;&#x4E00;&#x7AE0;</h2>
<ol>
<li>&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x89E3;&#x6790;&#x5230;<code>&lt;body&gt;</code>&#x6807;&#x7B7E;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x4F1A;&#x6E32;&#x67D3;&#x9875;&#x9762;&#x7684;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#x3002;&#x628A;&#x811A;&#x672C;&#x653E;&#x5728;&#x9875;&#x9762;&#x9876;&#x90E8;&#x4F1A;&#x5BFC;&#x81F4;&#x660E;&#x663E;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#x901A;&#x5E38;&#x8868;&#x73B0;&#x4E3A;&#x663E;&#x793A;&#x7A7A;&#x767D;&#x9875;&#x9762;&#x3002;</li>
<li>&#x7531;&#x4E8E;JS&#x811A;&#x672C;&#x4F1A;&#x963B;&#x585E;&#x9875;&#x9762;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#x7684;&#x4E0B;&#x8F7D;&#xFF08;&#x6BD4;&#x5982;&#x56FE;&#x7247;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x63A8;&#x8350;<strong>&#x5C06;&#x6240;&#x6709;&#x7684;<code>&lt;script&gt;</code>&#x6807;&#x7B7E;</strong>&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x653E;&#x5230;<code>&lt;body&gt;</code>&#x6807;&#x7B7E;&#x7684;&#x5E95;&#x90E8;&#x3002;
&#x603B;&#x7ED3;&#xFF1A;<strong>&#x5C06;&#x811A;&#x672C;&#x653E;&#x5728;&#x5E95;&#x90E8;</strong>&#x3002;</li>
<li>&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;<code>&lt;script&gt;</code>&#x6807;&#x7B7E;<strong>&#x521D;&#x59CB;&#x4E0B;&#x8F7D;</strong>&#x65F6;&#x90FD;&#x4F1A;&#x963B;&#x585E;&#x9875;&#x9762;&#x6E32;&#x67D3;&#xFF0C;&#x6240;&#x4EE5;&#x51CF;&#x5C11;&#x9875;&#x9762;&#x5305;&#x542B;&#x7684;<code>&lt;script&gt;</code>&#x6807;&#x7B7E;&#x6570;&#x91CF;&#x6709;&#x52A9;&#x4E8E;&#x6539;&#x5584;&#x8FD9;&#x4E00;&#x60C5;&#x51B5;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6253;&#x5305;&#x5DE5;&#x5177;&#x6765;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;JS&#x6587;&#x4EF6;&#x3002;</li>
<li>&#x4E0B;&#x8F7D;&#x5355;&#x4E2A;100kb&#x7684;&#x6587;&#x4EF6;&#x6BD4;&#x4E0B;&#x8F7D;4&#x4E2A;25kb&#x7684;&#x6587;&#x4EF6;&#x66F4;&#x5FEB;&#x3002;<strong>&#x51CF;&#x5C11;&#x9875;&#x9762;&#x4E2D;&#x5916;&#x94FE;&#x811A;&#x672C;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x91CF;&#x5C06;&#x4F1A;&#x6539;&#x5584;&#x6027;&#x80FD;</strong>&#x3002;</li>
<li>&#x65E0;&#x963B;&#x585E;&#x811A;&#x672C;&#x7684;&#x79D8;&#x8BC0;&#x5728;&#x4E8E;&#xFF0C;&#x5728;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#x540E;&#x624D;&#x52A0;&#x8F7D;JavaScript&#x4EE3;&#x7801;&#x3002;&#x5728;window&#x5BF9;&#x8C61;&#x7684;onload&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x540E;&#x518D;&#x4E0B;&#x8F7D;&#x811A;&#x672C;&#x3002;</li>
<li>&#x5728;<code>&lt;script&gt;</code>&#x6807;&#x7B7E;&#x91CC;&#x4F7F;&#x7528;defer &#x6216;&#x8005; async &#x5C5E;&#x6027;&#x3002;&#x5BF9;&#x5E94;&#x7684;JavaScript&#x6587;&#x4EF6;&#x5C06;&#x5728;&#x9875;&#x9762;&#x89E3;&#x6790;&#x5230;<code>&lt;script&gt;</code>&#x6807;&#x7B7E;&#x65F6;&#x5F00;&#x59CB;&#x4E0B;&#x8F7D;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#xFF0C;&#x76F4;&#x5230;DOM&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#x3002;</li>
<li>&#x5E26;&#x6709;defer&#x5C5E;&#x6027;&#x7684;js&#x6587;&#x4EF6;&#x4E0B;&#x8F7D;&#x65F6;&#xFF0C;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x3002;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x4E0B;&#x8F7D;&#x3002;</li>
</ol>
<h2 id="&#x7B2C;&#x4E8C;&#x7AE0;">&#x7B2C;&#x4E8C;&#x7AE0;</h2>
<ol>
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5F15;&#x7528;&#x4E86;&#x4E09;&#x6B21;document&#xFF0C;&#x800C;document&#x662F;&#x4E2A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x3002;&#x641C;&#x7D22;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x8FC7;&#x7A0B;&#x5FC5;&#x987B;&#x904D;&#x5386;&#x6574;&#x4E2A;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E;&#x5728;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x4E2D;&#x627E;&#x5230;&#x3002;</li>
<li>&#x6267;&#x884C;&#x51FD;&#x6570;&#x65F6;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6210;&#x4E3A;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF08;&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#x7684;&#x5185;&#x90E8;&#x5BF9;&#x8C61;&#x3002;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6267;&#x884C;&#x65F6;&#x7684;&#x73AF;&#x5883;&#x3002;&#x51FD;&#x6570;&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x65F6;&#x5BF9;&#x5E94;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#x90FD;&#x662F;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x591A;&#x6B21;&#x8C03;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5C31;&#x4F1A;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;&#x3002;&#x5F53;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x6267;&#x884C;&#x73AF;&#x5883;&#x5C31;&#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#x3002;</li>
<li>&#x5728;&#x6267;&#x884C;&#x73AF;&#x5883;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x6240;&#x5728;&#x7684;&#x4F4D;&#x7F6E;&#x8D8A;&#x6DF1;&#xFF0C;&#x4ED6;&#x7684;&#x8BFB;&#x5199;&#x901F;&#x5EA6;&#x4E5F;&#x5C31;&#x8D8A;&#x6162;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x603B;&#x662F;&#x6700;&#x5FEB;&#x7684;&#x3002;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x901A;&#x5E38;&#x662F;&#x6700;&#x6162;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x603B;&#x662F;&#x5B58;&#x5728;&#x4E8E;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x7684;&#x6700;&#x672B;&#x7AEF;&#x3002;</li>
<li>&#x5982;&#x679C;&#x591A;&#x6B21;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x5F15;&#x7528;&#x50A8;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E2D;&#x3002;&#x5982;&#xFF1A; <code>var doc = document</code>&#xFF0C;&#x8FD9;&#x6837;&#x8BBF;&#x95EE;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x6B21;&#x6570;&#x4ECE;3&#x6B21;&#x53D8;&#x4E3A;1&#x6B21;&#x3002;&#x800C;&#x4E14;doc&#x662F;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x901A;&#x8FC7;&#x5B83;&#x8BBF;&#x95EE;document&#x4F1A;&#x66F4;&#x5FEB;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x95ED;&#x5305;&#x4E5F;&#x4F1A;&#x5BF9;&#x6027;&#x80FD;&#x6709;&#x5F71;&#x54CD;&#x3002;&#x95ED;&#x5305;&#x662F;JS&#x6700;&#x5F3A;&#x5927;&#x7684;&#x529F;&#x80FD;&#x4E4B;&#x4E00;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x51FD;&#x6570;&#x8BBF;&#x95EE;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x4E4B;&#x5916;&#x7684;&#x6570;&#x636E;&#x3002;</li>
<li>&#x51CF;&#x8F7B;&#x95ED;&#x5305;&#x5BF9;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x7684;&#x5F71;&#x54CD;&#xFF1A;&#x5C06;&#x5E38;&#x7528;&#x7684;&#x8DE8;&#x4F5C;&#x7528;&#x4E8E;&#x53D8;&#x91CF;&#x50A8;&#x5B58;&#x5728;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;</li>
<li><p>&#x901A;&#x8FC7;<code>hasOwnProperty()</code>&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x5305;&#x542B;&#x7279;&#x5B9A;&#x7684;&#x5B9E;&#x4F8B;&#x6210;&#x5458;&#x3002;</p>
<pre><code> let book = {
     name: &apos;js&apos;
 }

 book.hasOwnProperty(&apos;name&apos;) // true
 book.hasOwnProperty(&apos;toString&apos;) // false
</code></pre></li>
<li>&#x8981;&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x5305;&#x542B;&#x7279;&#x5B9A;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;in&#x64CD;&#x4F5C;&#x7B26;<pre><code> (&apos;name&apos; in book) // true
 (&apos;toString&apos; in book) // true &#x56E0;&#x4E3A;&#x4ED6;&#x5373;&#x4F1A;&#x641C;&#x7D22;&#x5B9E;&#x4F8B;&#xFF0C;&#x4E5F;&#x4F1A;&#x641C;&#x7D22;&#x539F;&#x578B;
</code></pre></li>
<li>&#x641C;&#x7D22;&#x5B9E;&#x4F8B;&#x6210;&#x5458;&#x6BD4;&#x4ECE;&#x5B57;&#x9762;&#x91CF;&#x6216;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x4EE3;&#x4EF7;&#x66F4;&#x9AD8;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x4FBF;&#x5229;&#x539F;&#x578B;&#x94FE;&#x5E26;&#x6765;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x8BA9;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x66F4;&#x4E3A;&#x4E25;&#x91CD;&#x3002;</li>
<li>&#x5BF9;&#x8C61;&#x6210;&#x5458;&#x5D4C;&#x5957;&#x5F97;&#x8D8A;&#x6DF1;&#xFF0C;&#x8BFB;&#x53D6;&#x901F;&#x5EA6;&#x5C31;&#x4F1A;&#x8D8A;&#x6162;&#x3002;&#x5982;  &#x8BFB;&#x53D6;loaction.href &#x6BD4; window.loaction.href  &#x5FEB;&#x3002;</li>
<li>&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x5982;&#x679C;&#x8981;&#x591A;&#x6B21;&#x8BFB;&#x53D6;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#xFF0C;&#x6700;&#x4F73;&#x505A;&#x6CD5;&#x662F;&#x5C06;&#x5C5E;&#x6027;&#x4FDD;&#x5B58;&#x5230;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E2D;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x80FD;&#x591F;&#x7528;&#x6765;&#x4EE3;&#x66FF;&#x5C5E;&#x6027;&#x4EE5;&#x907F;&#x514D;&#x591A;&#x6B21;&#x67E5;&#x627E;&#x5E26;&#x6765;&#x7684;&#x6027;&#x80FD;&#x5F00;&#x9500;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x8D4B;&#x503C;&#x7ED9;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x6210;&#x5458;&#x65B9;&#x6CD5;&#x3002;&#x56E0;&#x4E3A;&#x8BB8;&#x591A;&#x5BF9;&#x8C61;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;this&#x6765;&#x5224;&#x65AD;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65B9;&#x6CD5;&#x4FDD;&#x5B58;&#x5728;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4F1A;&#x5BFC;&#x81F4;this&#x7ED1;&#x5B9A;&#x5230;window&#xFF0C;&#x800C;this&#x503C;&#x7684;&#x6539;&#x53D8;&#x4F1A;&#x4F7F;&#x5F97;JavaScript&#x5F15;&#x64CE;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x89E3;&#x6790;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#x6210;&#x5458;&#xFF0C;&#x8FDB;&#x800C;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x51FA;&#x9519;&#x3002;</li>
</ol>
<h2 id="&#x7B2C;&#x4E09;&#x7AE0;">&#x7B2C;&#x4E09;&#x7AE0;</h2>
<ol>
<li>&#x9891;&#x7E41;&#x7684;&#x8BBF;&#x95EE;DOM&#x4E5F;&#x4F1A;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#x3002;&#x8BBF;&#x95EE;DOM&#x7684;&#x6B21;&#x6570;&#x8D8A;&#x591A;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x8D8A;&#x6162;&#x3002;</li>
<li>&#x5F53;&#x9875;&#x9762;&#x5E03;&#x5C40;&#x548C;&#x51E0;&#x4F55;&#x5C5E;&#x6027;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x201C;&#x91CD;&#x6392;&#x201D;&#x3002;</li>
<li>&#x6BCF;&#x6B21;&#x91CD;&#x6392;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x8BA1;&#x7B97;&#x6D88;&#x8017;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6D4F;&#x89C8;&#x5668;&#x901A;&#x8FC7;&#x961F;&#x5217;&#x5316;&#x4FEE;&#x6539;&#x5E76;&#x6279;&#x91CF;&#x6267;&#x884C;&#x6765;&#x4F18;&#x5316;&#x91CD;&#x6392;&#x8FC7;&#x7A0B;&#x3002;</li>
<li>&#x6D4F;&#x89C8;&#x5668;&#x9700;&#x8981;&#x91CD;&#x6392;&#x7684;&#x6B21;&#x6570;&#x8D8A;&#x5C0F;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#x5C31;&#x8D8A;&#x5FEB;&#x3002;</li>
<li>&#x5982;&#x679C;&#x901A;&#x8FC7;dom&#x6539;&#x53D8;&#x5143;&#x7D20;&#x7684;&#x51E0;&#x4F55;&#x5C5E;&#x6027;&#xFF08;&#x5BBD;&#x9AD8;&#xFF09;&#xFF0C;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#x7684;&#x51E0;&#x4F55;&#x5C5E;&#x6027;&#x4E5F;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x4F7F;&#x6E32;&#x67D3;&#x6811;&#x4E2D;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x7684;&#x90E8;&#x5206;&#x5931;&#x6548;&#xFF0C;&#x5E76;&#x91CD;&#x65B0;&#x6784;&#x9020;&#x6E32;&#x67D3;&#x6811;&#x3002;<strong>&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x91CD;&#x6392;&#xFF08;reflow&#xFF09;</strong>&#x3002;</li>
<li>&#x5B8C;&#x6210;&#x91CD;&#x6392;&#x540E;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#x53D7;&#x5F71;&#x54CD;&#x7684;&#x90E8;&#x5206;&#x5230;&#x5C4F;&#x5E55;&#x4E2D;&#xFF0C;<strong>&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x91CD;&#x7ED8;&#xFF08;repaint&#xFF09;</strong>&#x3002;</li>
<li><strong>&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;dom&#x53D8;&#x5316;&#x90FD;&#x4F1A;&#x5F71;&#x54CD;&#x51E0;&#x4F55;&#x5C5E;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x80CC;&#x666F;&#x8272;&#x5E76;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5B83;&#x7684;&#x5BBD;&#x548C;&#x9AD8;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EA;&#x4F1A;&#x53D1;&#x751F;&#x4E00;&#x6B21;&#x91CD;&#x7ED8;&#xFF0C;&#x56E0;&#x4E3A;&#x5143;&#x7D20;&#x7684;&#x5E03;&#x5C40;&#x5E76;&#x6CA1;&#x6709;&#x6539;&#x53D8;</strong>&#x3002;</li>
<li>&#x91CD;&#x6392;&#x53D1;&#x751F;&#x5728;<strong>&#x9875;&#x9762;&#x5E03;&#x5C40;&#x548C;&#x51E0;&#x4F55;&#x5C5E;&#x6027;&#x6539;&#x53D8;</strong>&#x65F6;&#x5C31;&#x9700;&#x8981;&#x91CD;&#x6392;&#x3002;<ul>
<li>&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x53EF;&#x89C1;&#x7684;DOM&#x5143;&#x7D20;</li>
<li>&#x5143;&#x7D20;&#x4F4D;&#x7F6E;&#x6539;&#x53D8;</li>
<li>&#x5143;&#x7D20;&#x5C3A;&#x5BF8;&#x6539;&#x53D8;&#xFF08;&#x5305;&#x62EC;&#xFF1A;&#x5916;&#x8FB9;&#x8DDD;&#x3001;&#x5185;&#x8FB9;&#x8DDD;&#x3001;&#x8FB9;&#x6846;&#x539A;&#x5EA6;&#x3001;&#x5BBD;&#x5EA6;&#x3001;&#x9AD8;&#x5EA6;&#x7B49;&#x5C5E;&#x6027;&#x6539;&#x53D8;&#x3002;&#xFF09;</li>
<li>&#x5185;&#x5BB9;&#x6539;&#x53D8;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x6587;&#x672C;&#x6539;&#x53D8;&#x6216;&#x56FE;&#x7247;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#x7684;&#x56FE;&#x7247;&#x66FF;&#x4EE3;</li>
<li>&#x9875;&#x9762;&#x6E32;&#x67D3;&#x521D;&#x59CB;&#x5316;</li>
<li>&#x6D4F;&#x89C8;&#x5668;&#x7A97;&#x53E3;&#x5C3A;&#x5BF8;&#x6539;&#x53D8;</li>
</ul>
</li>
<li>&#x5F53;&#x4F60;&#x9700;&#x8981;&#x5BF9;DOM&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#x6765;&#x51CF;&#x5C11;&#x91CD;&#x7ED8;&#x548C;&#x91CD;&#x6392;&#x7684;&#x6B21;&#x6570;&#xFF1A;<ul>
<li>&#x4F7F;&#x5143;&#x7D20;&#x8131;&#x79BB;&#x6587;&#x6863;&#x6D41;</li>
<li>&#x5BF9;&#x5176;&#x5E94;&#x7528;&#x591A;&#x91CD;&#x6539;&#x53D8;</li>
<li>&#x628A;&#x5143;&#x7D20;&#x5E26;&#x56DE;&#x6587;&#x6863;&#x4E2D;</li>
</ul>
</li>
</ol>
<p>&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x91CC;&#x4F1A;&#x89E6;&#x53D1;&#x4E24;&#x6B21;&#x91CD;&#x6392;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#x548C;&#x7B2C;&#x4E8C;&#x6B65;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5FFD;&#x7565;&#x8FD9;&#x4E24;&#x6B65;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x7B2C;&#x4E8C;&#x6B65;<strong>&#x6240;&#x4EA7;&#x751F;&#x7684;&#x4EFB;&#x4F55;&#x4FEE;&#x6539;&#x90FD;&#x4F1A;&#x89E6;&#x53D1;&#x4E00;&#x6B21;&#x91CD;&#x6392;</strong>&#x3002;</p>
<ol>
<li>&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4F7F;dom&#x8131;&#x79BB;&#x6587;&#x6863;&#xFF1A;<ul>
<li>&#x9690;&#x85CF;&#x5143;&#x7D20;&#xFF0C;&#x5E94;&#x7528;&#x4FEE;&#x6539;&#xFF0C;&#x91CD;&#x65B0;&#x663E;&#x793A;</li>
<li>&#x4F7F;&#x7528;&#x6587;&#x6863;&#x7247;&#x6BB5;&#x5728;&#x5F53;&#x524D;DOM&#x4E4B;&#x5916;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5B50;&#x6811;&#xFF0C;&#x518D;&#x628A;&#x5B83;&#x62F7;&#x8D1D;&#x56DE;&#x6587;&#x6863;</li>
<li>&#x5C06;&#x539F;&#x59CB;&#x5143;&#x7D20;&#x62F7;&#x8D1D;&#x5230;&#x4E00;&#x4E2A;&#x8131;&#x79BB;&#x6587;&#x6863;&#x7684;&#x8282;&#x70B9;&#x4E2D;&#xFF0C;&#x4FEE;&#x6539;&#x526F;&#x672C;&#xFF0C;&#x5B8C;&#x6210;&#x540E;&#x518D;&#x66FF;&#x6362;&#x539F;&#x59CB;&#x5143;&#x7D20;</li>
</ul>
</li>
<li>&#x5728;IE&#x4E2D;&#x5927;&#x91CF;&#xFF1A;hover&#x4F1A;&#x964D;&#x4F4E;&#x6027;&#x80FD;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x59D4;&#x6258;&#x6765;&#x51CF;&#x5C11;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x7684;&#x6570;&#x91CF;&#x3002;</li>
</ol>
<h2 id="&#x7B2C;&#x56DB;&#x7AE0;">&#x7B2C;&#x56DB;&#x7AE0;</h2>
<ol>
<li>&#x5728;&#x5927;&#x591A;&#x6570;&#x53D8;&#x6210;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x5927;&#x90E8;&#x5206;&#x6D88;&#x8017;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x3002;&#x5FAA;&#x73AF;&#x5904;&#x7406;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x5F0F;&#x4E4B;&#x4E00;&#xFF0C;&#x4E5F;&#x662F;&#x63D0;&#x5347;&#x6027;&#x80FD;&#x5FC5;&#x987B;&#x5173;&#x6CE8;&#x7684;&#x8981;&#x70B9;&#x4E4B;&#x4E00;&#x3002;</li>
<li>&#x5FAA;&#x73AF;&#x7C7B;&#x578B;&#x5305;&#x62EC; for&#x5FAA;&#x73AF;&#x3001;while&#x5FAA;&#x73AF;&#x3001;do-while&#x5FAA;&#x73AF;&#x548C;for-in&#x5FAA;&#x73AF;&#x3002;&#x8FD9;&#x4E9B;&#x5FAA;&#x73AF;&#x5F53;&#x4E2D;&#x53EA;&#x6709;for-in&#x5FAA;&#x73AF;&#x6BD4;&#x5176;&#x4ED6;&#x51E0;&#x79CD;&#x660E;&#x663E;&#x8981;&#x6162;&#x3002;
3.&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;<code>length</code>&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x6837;&#x5FAA;&#x73AF;&#x8FD0;&#x884C;&#x524D;&#x53EA;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5C5E;&#x6027;&#x67E5;&#x627E;&#x3002;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;<pre><code> for(let i=0; i&lt;item.length; i++)
 &#x5199;&#x6210;
 for(let i=0, len=item.length; i&lt;len; i++)
</code></pre></li>
<li>&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5012;&#x5E8F;&#x5FAA;&#x73AF;&#x6765;&#x63D0;&#x5347;&#x6027;&#x80FD;&#xFF0C;&#x5982;&#xFF1A;<code>var i=items.length i--</code></li>
<li><p>Duff&apos;s Device</p>
<pre><code> let i = item.length % 8
 while(i) {
     process(item[i--])
 }

 i = Math.floor(item.length % 8)

 whilte(i) {
     process(item[i--])
     process(item[i--])
     process(item[i--])
     process(item[i--])
     process(item[i--])
     process(item[i--])
     process(item[i--])
     process(item[i--])
 }
</code></pre></li>
<li>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;switch&#x6BD4;if-else&#x8FD0;&#x884C;&#x8981;&#x5FEB;&#xFF0C;&#x4F46;&#x53EA;&#x6709;&#x5F53;&#x6761;&#x4EF6;&#x6570;&#x91CF;&#x5F88;&#x5927;&#x65F6;&#x624D;&#x5FEB;&#x5F97;&#x660E;&#x663E;&#x3002;</li>
<li>&#x5728;&#x6761;&#x4EF6;&#x6570;&#x91CF;&#x8F83;&#x5C11;&#x65F6;&#x4F7F;&#x7528;if-else&#xFF0C;&#x800C;&#x5728;&#x6761;&#x4EF6;&#x6570;&#x91CF;&#x8F83;&#x5927;&#x65F6;&#x4F7F;&#x7528;switch&#x3002;</li>
<li>&#x4F18;&#x5316;if-else&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x786E;&#x4FDD;<strong>&#x6700;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x6761;&#x4EF6;&#x653E;&#x5728;&#x9996;&#x4F4D;</strong>&#x3002;if-else&#x4E2D;&#x7684;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x5E94;&#x8BE5;&#x603B;&#x662F;&#x6309;&#x7167;&#x4ECE;<strong>&#x6700;&#x5927;&#x6982;&#x7387;&#x5230;&#x6700;&#x5C0F;&#x6982;&#x7387;&#x7684;&#x987A;&#x5E8F;&#x6392;&#x5217;</strong>&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x6700;&#x5FEB;&#x3002;</li>
<li>&#x4F18;&#x5316;if-else&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x7CFB;&#x5217;&#x5D4C;&#x5957;&#x7684;if-else&#x8BED;&#x53E5;&#x3002;<pre><code> if (value &lt; 6) {
     if (value &lt; 3) {
     if (value === 2) {
         console.log(&apos;result2&apos;);
     } else if (value === 1) {
         console.log(&apos;result1&apos;);
     } else {
         console.log(&apos;result0&apos;);
     }
     } else {
     if (value === 3) {
         console.log(&apos;result3&apos;);
     } else if (value === 4) {
         console.log(&apos;result4&apos;);
     } else {
         console.log(&apos;result5&apos;);
     }
     }
     } else {
     if (value &lt; 8) {
     if (value === 7) {
         console.log(&apos;result7&apos;);
     } else {
         console.log(&apos;result6&apos;);
     }
     } else {
     if (value === 8) {
         console.log(&apos;result8&apos;);
     } else if (value === 9) {
         console.log(&apos;result9&apos;);
     } else {
         console.log(&apos;result10&apos;);
     }
     }
 }
</code></pre></li>
<li>&#x4F7F;&#x7528;<strong>&#x67E5;&#x627E;&#x8868;</strong>&#xFF08;<strong>&#x6570;&#x7EC4;</strong>&#xFF09;&#x6BD4;if-else&#x548C;switch&#x66F4;&#x5FEB;&#x3002;&#x4F18;&#x70B9;&#x662F;&#x4E0D;&#x7528;&#x4E66;&#x5199;&#x4EFB;&#x4F55;&#x6761;&#x4EF6;&#x5224;&#x65AD;&#x8BED;&#x53E5;&#xFF0C;&#x5373;&#x4FBF;&#x5019;&#x9009;&#x503C;&#x6570;&#x91CF;&#x589E;&#x52A0;&#x65F6;&#xFF0C;&#x4E5F;&#x51E0;&#x4E4E;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x989D;&#x5916;&#x7684;&#x6027;&#x80FD;&#x5F00;&#x9500;&#x3002;</li>
<li>&#x5F53;&#x5355;&#x4E2A;&#x952E;&#x548C;&#x5355;&#x4E2A;&#x503C;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x903B;&#x8F91;&#x6620;&#x5C04;&#x65F6;&#xFF0C;&#x67E5;&#x627E;&#x8868;&#x7684;&#x4F18;&#x52BF;&#x5C31;&#x80FD;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x3002;<code>switch</code>&#x8BED;&#x53E5;<strong>&#x66F4;&#x9002;&#x5408;&#x4E8E;&#x6BCF;&#x4E2A;&#x952E;&#x90FD;&#x9700;&#x8981;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x72EC;&#x7279;&#x7684;&#x52A8;&#x4F5C;&#x6216;&#x4E00;&#x7CFB;&#x5217;&#x52A8;&#x4F5C;&#x7684;&#x573A;&#x5408;</strong>&#x3002;</li>
<li>JavaScript&#x5F15;&#x64CE;&#x652F;&#x6301;&#x7684;&#x9012;&#x5F52;&#x6570;&#x91CF;&#x4E0E;JavaScript&#x8C03;&#x7528;&#x6808;&#x5927;&#x5C0F;&#x76F4;&#x63A5;&#x76F8;&#x5173;&#x3002;</li>
<li>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5BFC;&#x81F4;&#x6808;&#x6EA2;&#x51FA;&#x7684;&#x539F;&#x56E0;&#x662F;<strong>&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;</strong>&#x3002;</li>
<li>&#x5B57;&#x7B26;&#x4E32;&#x5408;&#x5E76;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;<pre><code>The + operator: str = &apos;a&apos; + &apos;b&apos; + &apos;c&apos;
The += operator: str = &apos;a&apos;
                str += &apos;b&apos;
                str += &apos;c&apos;
array.join(): str = [&apos;a&apos;, &apos;b&apos;, &apos;c&apos;].join(&quot;&quot;)
string.concat(): str = &apos;a&apos;
                str = str.concat([&apos;a&apos;, &apos;b&apos;])
</code></pre></li>
<li><code>str += &apos;one&apos; + &apos;two&apos;</code>&#xFF1B;&#x6B64;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x4F1A;&#x7ECF;&#x5386;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;<ul>
<li>&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x5B57;&#x7B26;&#x4E32;</li>
<li>&#x8FDE;&#x63A5;&#x540E;&#x7684;&#x5B57;&#x7B26;&#x4E32;&apos;onetwo&apos;&#x88AB;&#x8D4B;&#x503C;&#x7ED9;&#x8BE5;&#x4E34;&#x65F6;&#x5B57;&#x7B26;&#x4E32;</li>
<li>&#x4E34;&#x65F6;&#x5B57;&#x7B26;&#x4E32;&#x4E0E;str&#x5F53;&#x524D;&#x7684;&#x503C;&#x8FDE;&#x63A5;</li>
<li>&#x8FDE;&#x63A5;&#x540E;&#x7684;&#x503C;&#x8D4B;&#x503C;&#x7ED9;str</li>
</ul>
</li>
<li>&#x4F18;&#x5316;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;:<code>str += &apos;one&apos;;str += &apos;two&apos;;</code>&#x6216;&#x8005;<code>str = str + &apos;one&apos; + &apos;two&apos;</code>&#x3002;</li>
<li>&#x8D4B;&#x503C;&#x8868;&#x8FBE;&#x5F0F;&#x7531;str&#x4F5C;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x6BCF;&#x6B21;&#x7ED9;&#x4ED6;&#x9644;&#x52A0;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7531;&#x5DE6;&#x5411;&#x53F3;&#x4F9D;&#x6B21;&#x8FDE;&#x63A5;&#xFF0C;&#x56E0;&#x6B64;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x4E86;<strong>&#x4E34;&#x65F6;&#x5B57;&#x7B26;&#x4E32;</strong>&#x3002;</li>
<li>&#x9664;IE&#x6D4F;&#x89C8;&#x5668;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x5C1D;&#x8BD5;&#x4E3A;<strong>&#x8868;&#x8FBE;&#x5F0F;&#x5DE6;&#x4FA7;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5206;&#x914D;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5B58;</strong>&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x7B2C;&#x4E8C;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x62F7;&#x8D1D;&#x81F3;&#x5B83;&#x7684;&#x7ED3;&#x5C3E;&#x3002;</li>
<li>&#x5728;IE7&#x53CA;&#x4E00;&#x4E0B;&#x7528;<code>join()</code>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#x4F18;&#x5316;&#xFF1A;<strong>&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x6765;&#x63A5;&#x6536;&#x5408;&#x5E76;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;<code>join(&quot;&quot;)</code>&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x3002;</strong></li>
<li>&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x6162;&#x7684;&#x539F;&#x56E0;&#x901A;&#x5E38;&#x662F;&#x5339;&#x914D;&#x5931;&#x8D25;&#x7684;&#x8FC7;&#x7A0B;&#x6162;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5339;&#x914D;&#x6210;&#x529F;&#x7684;&#x8FC7;&#x7A0B;&#x6162;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x5339;&#x914D;&#x8FC7;&#x7A0B;&#x53D8;&#x5FEB;&#x800C;&#x5931;&#x8D25;&#x8FC7;&#x7A0B;&#x53D8;&#x6162;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x7684;&#x4FEE;&#x6539;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x7684;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x9700;&#x8981;&#xFF1A;<ul>
<li>&#x8D77;&#x59CB;&#x6807;&#x8BB0;&#xFF1A;<code>^ $</code></li>
<li>&#x7279;&#x5B9A;&#x7684;&#x5B57;&#x7B26;&#x4E32;</li>
<li>&#x5B57;&#x7B26;&#x7C7B;&#xFF1A;<code>\d [a-z]</code>&#x7B49;</li>
<li>&#x5355;&#x8BCD;&#x8FB9;&#x754C;&#xFF1A;<code>\b</code></li>
<li>&#x907F;&#x514D;&#xFF1A;<ul>
<li>&#x5206;&#x7EC4;&#x6216;&#x9009;&#x62E9;&#x5B57;&#x5143;&#x5F00;&#x5934;</li>
<li>&#x7C7B;&#x4F3C;<code>one|two</code>&#x7684;&#x9876;&#x5C42;&#x5206;&#x652F;</li>
</ul>
</li>
</ul>
</li>
<li>&#x4F7F;&#x7528;&#x5B57;&#x7B26;&#x96C6;&#x548C;&#x9009;&#x9879;&#x7EC4;&#x4EF6;&#x6765;&#x51CF;&#x5C11;&#x5BF9;&#x5206;&#x652F;&#x7684;&#x9700;&#x6C42;&#xFF1A;<pre><code>// &#x66FF;&#x6362;&#x524D;   &#x66FF;&#x6362;&#x540E;
cat|bat     [cb]at
red|read    rea?d
red|raw     r(?:ed|aw)
(.|\r|\n)   [\s\S]
</code></pre></li>
</ol>
<h2 id="&#x7B2C;&#x516D;&#x7AE0;">&#x7B2C;&#x516D;&#x7AE0;</h2>
<ol>
<li><strong>&#x7528;&#x4E8E;&#x6267;&#x884C;JavaScript&#x548C;&#x66F4;&#x65B0;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x8FDB;&#x7A0B;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x6D4F;&#x89C8;&#x5668;UI&#x7EBF;&#x7A0B;&#x201D;&#x3002;UI&#x7EBF;&#x7A0B;&#x7684;&#x5DE5;&#x4F5C;&#x57FA;&#x4E8E;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x961F;&#x5217;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EFB;&#x52A1;&#x4F1A;&#x88AB;&#x4FDD;&#x5B58;&#x5230;&#x961F;&#x5217;&#x4E2D;&#x76F4;&#x5230;&#x8FDB;&#x7A0B;&#x7A7A;&#x95F2;&#x3002;&#x4E00;&#x65E6;&#x7A7A;&#x95F2;&#xFF0C;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x5C31;&#x88AB;&#x91CD;&#x65B0;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x5E76;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x8981;&#x4E48;&#x662F;&#x8FD0;&#x884C;JavaScript&#x4EE3;&#x7801;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x6267;&#x884C;UI&#x66F4;&#x65B0;&#xFF0C;&#x5305;&#x62EC;&#x91CD;&#x7ED8;&#x548C;&#x91CD;&#x6392;&#x3002;</strong></li>
<li>&#x5B9A;&#x65F6;&#x5668;&#x7684;&#x65F6;&#x95F4;<strong>&#x4ECE;&#x4EE3;&#x7801;&#x521B;&#x5EFA;&#x5F00;&#x59CB;&#x65F6;&#x8BA1;&#x65F6;</strong>&#x3002;&#x5E76;&#x5728;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x540E;<strong>&#x52A0;&#x5165;&#x4EFB;&#x52A1;&#x961F;&#x5217;</strong>&#x3002;</li>
<li>&#x5982;&#x679C;&#x6267;&#x884C;&#x5B9A;&#x65F6;&#x5668;&#x7684;&#x51FD;&#x6570;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x8F83;&#x957F;&#x751A;&#x81F3;&#x8D85;&#x8FC7;&#x5B9A;&#x65F6;&#x5668;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x5B9A;&#x65F6;&#x5668;&#x4F1A;&#x5728;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x4E4B;&#x540E;&#x7ACB;&#x9A6C;&#x6267;&#x884C;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;&#x5B9A;&#x65F6;&#x5668;&#x7684;&#x771F;&#x5B9E;&#x5EF6;&#x65F6;&#x65F6;&#x95F4;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x6765;&#x8BF4;&#x53D6;&#x51B3;&#x4E8E;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x3002;&#x666E;&#x904D;&#x6765;&#x8BB2;&#xFF0C;&#x6700;&#x597D;&#x4F7F;&#x7528;&#x6700;&#x5C11;25&#x6BEB;&#x79D2;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5C0F;&#x7684;&#x5EF6;&#x65F6;&#xFF0C;&#x5BF9;&#x5927;&#x591A;&#x6570;UI&#x66F4;&#x65B0;&#x6765;&#x8BF4;&#x4E0D;&#x591F;&#x7528;&#x3002;</li>
</ol>
<h2 id="&#x7B2C;&#x4E03;&#x7AE0;">&#x7B2C;&#x4E03;&#x7AE0;</h2>
<ol>
<li>&#x4F7F;&#x7528;xht&#x65F6;&#xFF0C;<code>POST</code>&#x548C;<code>GET</code>&#x7684;&#x5BF9;&#x6BD4;&#xFF1A;</li>
<li>&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x670D;&#x52A1;&#x5668;&#x72B6;&#x6001;&#xFF0C;&#x53EA;&#x4F1A;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF08;&#x5E42;&#x7B49;&#x884C;&#x4E3A;&#xFF09;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;GET&#x3002;<strong>&#x7ECF;GET&#x8BF7;&#x6C42;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x591A;&#x6B21;&#x8BF7;&#x6C42;&#x540C;&#x4E00;&#x6570;&#x636E;&#x7684;&#x8BDD;&#xFF0C;&#x4ED6;&#x4F1A;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x5347;&#x6027;&#x80FD;&#x3002;</strong><blockquote>
<p>&#x5E42;&#x7B49;&#x884C;&#x4E3A;&#xFF1A;&#x82E5;&#x5E72;&#x6B21;&#x8BF7;&#x6C42;&#x7684;&#x526F;&#x4F5C;&#x7528;&#x4E0E;&#x5355;&#x8BCD;&#x8BF7;&#x6C42;&#x76F8;&#x540C;&#x6216;&#x8005;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x8BF7;&#x6C42;&#x65B9;&#x6CD5;&#x5C31;&#x80FD;&#x591F;&#x88AB;&#x89C6;&#x4F5C;&#x201C;&#x5E42;&#x7B49;&#x201D;&#x7684;&#x3002;GET&#x8BF7;&#x6C42;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x4EA7;&#x751F;&#x5176;&#x4ED6;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5177;&#x6709;&#x5E42;&#x7B49;&#x5C5E;&#x6027;&#x3002;</p>
</blockquote>
</li>
<li>&#x5F53;&#x8BF7;&#x6C42;&#x7684;URL&#x52A0;&#x4E0A;&#x53C2;&#x6570;&#x7684;&#x957F;&#x5EA6;&#x63A5;&#x8FD1;&#x6216;&#x8D85;&#x8FC7;2048&#x4E2A;&#x5B57;&#x7B26;&#x65F6;&#xFF0C;&#x624D;&#x5E94;&#x8BE5;&#x7528;POST&#x83B7;&#x53D6;&#x6570;&#x636E;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x663E;&#x793A;URL&#x957F;&#x5EA6;&#xFF0C;&#x8FC7;&#x957F;&#x65F6;&#x5C06;&#x4F1A;&#x5BFC;&#x81F4;&#x8BF7;&#x6C42;&#x7684;URL&#x88AB;&#x622A;&#x65AD;&#x3002;</li>
<li>&#x5F53;&#x4F7F;&#x7528;XHR&#x53D1;&#x9001;&#x6570;&#x636E;&#x5230;&#x670D;&#x52A1;&#x5668;&#x65F6;&#xFF0C;GET&#x65B9;&#x5F0F;&#x4F1A;&#x66F4;&#x5FEB;&#x3002;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x5C11;&#x91CF;&#x6570;&#x636E;&#x800C;&#x8A00;&#xFF0C;&#x4E00;&#x4E2A;GET&#x8BF7;&#x6C42;&#x5F80;&#x670D;&#x52A1;&#x5668;&#x53EA;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x3002;&#x800C;&#x4E00;&#x4E2A;POST&#x8BF7;&#x6C42;&#xFF0C;&#x81F3;&#x5C11;&#x8981;&#x53D1;&#x9001;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x4E00;&#x4E2A;&#x88C5;&#x8F7D;&#x5934;&#x4FE1;&#x606F;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x88C5;&#x8F7D;POST&#x6B63;&#x6587;&#x3002;POST&#x66F4;&#x9002;&#x5408;&#x53D1;&#x9001;&#x5927;&#x91CF;&#x6570;&#x636E;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;</li>
<li>&#x5F53;&#x4F7F;&#x7528;XHR&#x65F6;&#xFF0C;JSON&#x6570;&#x636E;&#x88AB;&#x5F53;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#x8FD4;&#x56DE;&#x3002;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x7D27;&#x63A5;&#x7740;&#x88AB;eval()&#x8F6C;&#x6362;&#x6210;&#x539F;&#x751F;&#x5BF9;&#x8C61;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x811A;&#x672C;&#x6CE8;&#x5165;&#x65F6;&#xFF0C;JOSN&#x6570;&#x636E;&#x88AB;&#x5F53;&#x6210;&#x53E6;&#x4E00;&#x4E2A;JavaScript&#x6587;&#x4EF6;&#x5E76;&#x4F5C;&#x4E3A;&#x539F;&#x751F;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x3002;&#x4E3A;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x91CC;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;JSON&#x586B;&#x5145;(JSON with padding)&#x201D;&#x6216;JSON-P&#x3002;</li>
<li>&#x6700;&#x5FEB;&#x7684;Ajax&#x8BF7;&#x6C42;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x8BF7;&#x6C42;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x907F;&#x514D;&#x53D1;&#x9001;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x8BF7;&#x6C42;&#xFF1A;</li>
<li>&#x5728;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x8BBE;&#x7F6E;HTTP&#x5934;&#x4FE1;&#x606F;&#x4EE5;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x54CD;&#x5E94;&#x4F1A;&#x88AB;&#x6D4F;&#x89C8;&#x5668;&#x7F13;&#x5B58;</li>
<li>&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x628A;&#x83B7;&#x53D6;&#x5230;&#x7684;&#x4FE1;&#x606F;&#x50A8;&#x5B58;&#x5230;&#x672C;&#x5730;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x518D;&#x6B21;&#x8BF7;&#x6C42;</li>
<li>&#x8981;&#x4F7F;&#x76F8;&#x5E94;&#x7F13;&#x5B58;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;HTTP&#x5934;&#x90E8; <code>Expires</code>&#xFF0C;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x5934;&#x80FD;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x7F13;&#x5B58;&#x65E5;&#x671F;&#xFF0C;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x65E5;&#x671F;&#x540E;&#xFF0C;&#x8BF7;&#x6C42;&#x5C31;&#x76F4;&#x63A5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x8BF7;&#x6C42;&#x3002;</li>
<li>&#x53EF;&#x662F;&#x624B;&#x52A8;&#x8BBE;&#x7F6E;&#x7F13;&#x5B58;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x9875;&#x9762;&#x4E2D;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;url&#x4F5C;&#x4E3A;&#x952E;&#x503C;&#xFF0C;&#x8BF7;&#x6C42;&#x4E4B;&#x540E; &#x50A8;&#x5B58;&#x5230;&#x53D8;&#x91CF;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x6267;&#x884C;&#x4E86;&#x67D0;&#x4E9B;&#x52A8;&#x4F5C;&#x5BFC;&#x81F4;&#x7F13;&#x5B58;&#x5931;&#x6548;&#xFF0C;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x53D8;&#x91CF;&#x4E2D;&#x7684;url&#x3002;<code>delete localCache[&apos;/user/friendlist/&apos;]</code></li>
<li>&#x7B2C;&#x4E00;&#x79CD;&#x6D88;&#x9664;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x91CD;&#x590D;&#x5DE5;&#x4F5C;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;&#x3002;&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;&#x610F;&#x5473;&#x7740;&#x4FE1;&#x606F;&#x518D;&#x88AB;&#x4F7F;&#x7528;&#x524D;&#x4E0D;&#x4F1A;&#x505A;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x3002;&#x5728;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x68C0;&#x67E5;&#x5E76;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x65B9;&#x6CD5;&#x53BB;&#x7ED1;&#x5B9A;&#x6216;&#x53D6;&#x6D88;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x3002;&#x7136;&#x540E;&#x539F;&#x59CB;&#x51FD;&#x6570;&#x88AB;&#x5305;&#x542B;&#x6B63;&#x786E;&#x64CD;&#x4F5C;&#x7684;&#x65B0;&#x51FD;&#x6570;&#x8986;&#x76D6;&#x3002;</li>
<li>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F; &#x6761;&#x4EF6;&#x9884;&#x52A0;&#x8F7D;&#xFF0C;&#x4ED6;&#x4F1A;&#x5728;&#x811A;&#x672C;&#x52A0;&#x8F7D;&#x671F;&#x95F4;&#x63D0;&#x524D;&#x68C0;&#x6D4B;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x7B49;&#x5230;&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#x3002;<strong>&#x4F7F;&#x7528;&#x4E09;&#x5143;&#x8868;&#x8FBE;&#x5F0F;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;</strong>&#x3002;<pre><code class="lang-javascript"> <span class="hljs-keyword">const</span> addHandler = <span class="hljs-built_in">document</span>.body.addEventListener ? ... : ...
</code></pre>
</li>
<li>&#x6761;&#x4EF6;&#x9884;&#x52A0;&#x8F7D;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x76F8;&#x540C;&#x3002;&#x5176;&#x4EE3;&#x4EF7;&#x662F;&#x9700;&#x8981;&#x5728;&#x811A;&#x672C;&#x52A0;&#x8F7D;&#x65F6;&#x5C31;&#x68C0;&#x6D4B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x52A0;&#x8F7D;&#x540E;&#x3002;&#x9884;&#x52A0;&#x8F7D;&#x9002;&#x5408;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x9A6C;&#x4E0A;&#x5C31;&#x8981;&#x88AB;&#x7528;&#x5230;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x9891;&#x7E41;&#x51FA;&#x73B0;&#x7684;&#x573A;&#x5408;&#x3002;</li>
<li>JavaScript&#x7684;&#x539F;&#x751F;&#x65B9;&#x6CD5;&#x603B;&#x4F1A;&#x6BD4;&#x4F60;&#x5199;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x90FD;&#x8981;&#x5FEB;&#xFF0C;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x539F;&#x751F;&#x65B9;&#x6CD5;&#x3002;</li>
</ol>
<h2 id="&#x7B2C;&#x4E5D;&#x7AE0;">&#x7B2C;&#x4E5D;&#x7AE0;</h2>
<ol>
<li>&#x7F51;&#x7AD9;&#x63D0;&#x901F;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x4E00;&#x6761;&#x89C4;&#x5219;&#xFF0C;&#x5C31;&#x662F;&#x51CF;&#x5C11;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x6240;&#x9700;&#x7684;http&#x8BF7;&#x6C42;&#x6570;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x9488;&#x5BF9;&#x90A3;&#x4E9B;&#x9996;&#x6B21;&#x8BBF;&#x95EE;&#x7F51;&#x7AD9;&#x7684;&#x7528;&#x6237;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x628A;&#x90E8;&#x5206;&#x6587;&#x4EF6;&#x548C;&#x4EE3;&#x7801;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x5916;&#x94FE;&#x6587;&#x4EF6;&#x3002;</li>
<li>JavaScript&#x538B;&#x7F29;&#x6307;&#x7684;&#x662F;&#x628A;JavaScript&#x6587;&#x4EF6;&#x4E2D;&#x6240;&#x6709;&#x4E0E;&#x8FD0;&#x884C;&#x65E0;&#x5173;&#x7684;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x5265;&#x79BB;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5265;&#x79BB;&#x7684;&#x5185;&#x5BB9;&#x5305;&#x62EC;&#x6CE8;&#x91CA;&#x548C;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x3002;</li>
</ol>
<h2 id="&#x7B2C;&#x5341;&#x7AE0;">&#x7B2C;&#x5341;&#x7AE0;</h2>
<ol>
<li><p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x624B;&#x52A8;&#x63D2;&#x5165;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8BB0;&#x5F55;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x3002;</p>
<pre><code class="lang-javascript"> <span class="hljs-keyword">const</span> Timer = {
     _data: {},

     start: key =&gt; {
         Timer._data[key] = +<span class="hljs-keyword">new</span> Data()
     },

     stop: key =&gt; {
         <span class="hljs-keyword">let</span> time = TImer._data[key]
         <span class="hljs-keyword">if</span>(time) {
             Timer._data[key] = +<span class="hljs-keyword">new</span> Data() - time
         }
     },

     getTime: key =&gt; {
         <span class="hljs-keyword">return</span> Timer._data[key]
     }
 }

 Timer.start(<span class="hljs-string">&apos;create&apos;</span>)
 <span class="hljs-keyword">for</span>(<span class="hljs-keyword">let</span> i=<span class="hljs-number">0</span>;i&lt;<span class="hljs-number">1000</span>;i++) {
     element = <span class="hljs-built_in">document</span>.createElement(<span class="hljs-string">&apos;div&apos;</span>)
 }
 Timer.stop(<span class="hljs-string">&apos;create&apos;</span>)

 <span class="hljs-built_in">console</span>.log(Timer.getTime(<span class="hljs-string">&apos;create&apos;</span>))
</code></pre>
</li>
<li>&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x9650;&#x5236;&#x6BCF;&#x6B21;&#x8BF7;&#x6C42;&#x53EA;&#x80FD;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x4E3A;&#x4E86;&#x7BA1;&#x7406;&#x6587;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x811A;&#x672C;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x95F4;&#x9699;&#x5C31;&#x8BF4;&#x660E;&#x811A;&#x672C;&#x88AB;&#x963B;&#x585E;&#x4E86;&#x3002;<strong>&#x6709;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x662F;&#x5141;&#x8BB8;&#x5E76;&#x884C;&#x4E0B;&#x8F7D;&#xFF0C;&#x4F46;&#x963B;&#x585E;&#x8FD0;&#x884C;</strong>&#x3002;&#x867D;&#x7136;&#x8FD9;&#x6837;&#x505A;&#x80FD;&#x4F7F;&#x6587;&#x4EF6;&#x4E0B;&#x8F7D;&#x5F97;&#x66F4;&#x5FEB;&#xFF0C;&#x4F46;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x4ECD;&#x7136;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x6709;&#x811A;&#x672C;&#x90FD;&#x88AB;&#x6267;&#x884C;&#x3002;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="图解HTTP.html" class="navigation navigation-prev " aria-label="Previous page: 图解HTTP">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="响应式web设计html5和css3实战.html" class="navigation navigation-next " aria-label="Next page: 响应式web设计html5和css3实战">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"高性能JavaScript","level":"1.4","depth":1,"next":{"title":"响应式web设计html5和css3实战","level":"1.5","depth":1,"path":"book/响应式web设计html5和css3实战.md","ref":"book/响应式web设计html5和css3实战.md","articles":[]},"previous":{"title":"图解HTTP","level":"1.3","depth":1,"path":"book/图解HTTP.md","ref":"book/图解HTTP.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"book/高性能JavaScript.md","mtime":"2020-03-06T14:22:09.649Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-27T14:42:54.986Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

